[
  {
    "sortIndex": "1",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Know number names and the count sequence.",
    "code": "K.CC.1",
    "description": "Count to 100 by ones and by tens."
  },
  {
    "sortIndex": "2",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Know number names and the count sequence.",
    "code": "K.CC.2",
    "description": "Count forward beginning from a given number within the known sequence (instead of having to begin at 1)."
  },
  {
    "sortIndex": "3",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Know number names and the count sequence.",
    "code": "K.CC.3",
    "description": "Write numbers from 0 to 20. Represent a number of objects with a written numeral 0-20 (with 0 representing a count of no objects)."
  },
  {
    "sortIndex": "4",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Count to tell the number of objects.",
    "code": "K.CC.4",
    "description": "Understand the relationship between numbers and quantities; connect counting to cardinality."
  },
  {
    "sortIndex": "5",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Count to tell the number of objects.",
    "code": "K.CC.4 a.",
    "description": "When counting objects, say the number names in the standard order, pairing each object with one and only one number name and each number name with one and only one object."
  },
  {
    "sortIndex": "6",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Count to tell the number of objects.",
    "code": "K.CC.4 b.",
    "description": "Understand that the last number name said tells the number of objects counted. The number of objects is the same regardless of their arrangement or the order in which they were counted."
  },
  {
    "sortIndex": "7",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Count to tell the number of objects.",
    "code": "K.CC.4 c.",
    "description": "Understand that each successive number name refers to a quantity that is one larger."
  },
  {
    "sortIndex": "8",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Count to tell the number of objects.",
    "code": "K.CC.5",
    "description": "Count to answer “how many?” questions about as many as 20 things arranged in a line, a rectangular array, or a circle, or as many as 10 things in a scattered configuration; given a number from 1–20, count out that many objects."
  },
  {
    "sortIndex": "9",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Compare numbers.",
    "code": "K.CC.6",
    "description": "Identify whether the number of objects in one group is greater than, less than, or equal to the number of objects in another group, e.g., by using matching and counting strategies (include groups with up to ten objects)."
  },
  {
    "sortIndex": "10",
    "category": "Kindergarten",
    "subCategory": "Counting and Cardinality. Compare numbers.",
    "code": "K.CC.7",
    "description": "Compare two numbers between 1 and 10 presented as written numerals."
  },
  {
    "sortIndex": "11",
    "category": "Kindergarten",
    "subCategory": "Operations and Algebraic Thinking. Understand addition as putting together and adding to, and understand subtraction as taking apart and taking from.",
    "code": "K.OA.1",
    "description": "Represent addition and subtraction with objects, fingers, mental images, drawings (Drawings need not show details, but should show the mathematics in the problem.(This applies wherever drawings are mentioned in the Standards.)), sounds (e.g., claps), acting out situations, verbal explanations, expressions, or equations."
  },
  {
    "sortIndex": "12",
    "category": "Kindergarten",
    "subCategory": "Operations and Algebraic Thinking. Understand addition as putting together and adding to, and understand subtraction as taking apart and taking from.",
    "code": "K.OA.2",
    "description": "Solve addition and subtraction word problems, and add and subtract within 10, e.g., by using objects or drawings to represent the problem."
  },
  {
    "sortIndex": "13",
    "category": "Kindergarten",
    "subCategory": "Operations and Algebraic Thinking. Understand addition as putting together and adding to, and understand subtraction as taking apart and taking from.",
    "code": "K.OA.3",
    "description": "Decompose numbers less than or equal to 10 into pairs in more than one way, e.g., by using objects or drawings, and record each decomposition by a drawing or equation (e.g., 5 = 2 + 3 and 5 = 4 + 1)."
  },
  {
    "sortIndex": "14",
    "category": "Kindergarten",
    "subCategory": "Operations and Algebraic Thinking. Understand addition as putting together and adding to, and understand subtraction as taking apart and taking from.",
    "code": "K.OA.4",
    "description": "For any number from 1 to 9, find the number that makes 10 when added to the given number, e.g., by using objects or drawings, and record the answer with a drawing or equation."
  },
  {
    "sortIndex": "15",
    "category": "Kindergarten",
    "subCategory": "Operations and Algebraic Thinking. Understand addition as putting together and adding to, and understand subtraction as taking apart and taking from.",
    "code": "K.OA.5",
    "description": "Fluently add and subtract within 5."
  },
  {
    "sortIndex": "16",
    "category": "Kindergarten",
    "subCategory": "Number and Operations in Base Ten. Work with numbers 11–19 to gain foundations for place value.",
    "code": "K.NBT.1",
    "description": "Compose and decompose numbers from 11 to 19 into ten ones and some further ones, e.g., by using objects or drawings, and record each composition or decomposition by a drawing or equation (e.g., 18 = 10 + 8); understand that these numbers are composed of ten ones and one, two, three, four, five, six, seven, eight, or nine ones."
  },
  {
    "sortIndex": "17",
    "category": "Kindergarten",
    "subCategory": "Measurement and Data. Describe and compare measurable attributes.",
    "code": "K.MD.1",
    "description": "Describe measurable attributes of objects, such as length or weight. Describe several measurable attributes of a single object."
  },
  {
    "sortIndex": "18",
    "category": "Kindergarten",
    "subCategory": "Measurement and Data. Describe and compare measurable attributes.",
    "code": "K.MD.2",
    "description": "Directly compare two objects with a measurable attribute in common, to see which object has “more of”/“less of” the attribute, and describe the difference. For example, directly compare the heights of two children and describe one child as taller/shorter."
  },
  {
    "sortIndex": "19",
    "category": "Kindergarten",
    "subCategory": "Measurement and Data. Classify objects and count the number of objects in each category.",
    "code": "K.MD.3",
    "description": "Classify objects into given categories; count the numbers of objects in each category and sort the categories by count. (Limit category counts to be less than or equal to 10.)"
  },
  {
    "sortIndex": "20",
    "category": "Kindergarten",
    "subCategory": "Geometry. Identify and describe shapes (squares, circles, triangles, rectangles, hexagons, cubes, cones, cylinders, and spheres).",
    "code": "K.G.1",
    "description": "Describe objects in the environment using names of shapes, and describe the relative positions of these objects using terms such as above, below, beside, in front of, behind, and next to."
  },
  {
    "sortIndex": "21",
    "category": "Kindergarten",
    "subCategory": "Geometry. Identify and describe shapes (squares, circles, triangles, rectangles, hexagons, cubes, cones, cylinders, and spheres).",
    "code": "K.G.2",
    "description": "Correctly name shapes regardless of their orientations or overall size."
  },
  {
    "sortIndex": "22",
    "category": "Kindergarten",
    "subCategory": "Geometry. Identify and describe shapes (squares, circles, triangles, rectangles, hexagons, cubes, cones, cylinders, and spheres).",
    "code": "K.G.3",
    "description": "Identify shapes as two-dimensional (lying in a plane, “flat”) or three-dimensional (“solid”)."
  },
  {
    "sortIndex": "23",
    "category": "Kindergarten",
    "subCategory": "Geometry. Analyze, compare, create, and compose shapes.",
    "code": "K.G.4",
    "description": "Analyze and compare two- and three-dimensional shapes, in different sizes and orientations, using informal language to describe their similarities, differences, parts (e.g., number of sides and vertices/“corners”) and other attributes (e.g., having sides of equal length)."
  },
  {
    "sortIndex": "24",
    "category": "Kindergarten",
    "subCategory": "Geometry. Analyze, compare, create, and compose shapes.",
    "code": "K.G.5",
    "description": "Model shapes in the world by building shapes from components (e.g., sticks and clay balls) and drawing shapes."
  },
  {
    "sortIndex": "25",
    "category": "Kindergarten",
    "subCategory": "Geometry. Analyze, compare, create, and compose shapes.",
    "code": "K.G.6",
    "description": "Compose simple shapes to form larger shapes. For example, “Can you join these two triangles with full sides touching to make a rectangle?”"
  },
  {
    "sortIndex": "26",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving addition and subtraction.",
    "code": "1.OA.1",
    "description": "Use addition and subtraction within 20 to solve word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem. (See Glossary)"
  },
  {
    "sortIndex": "27",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving addition and subtraction.",
    "code": "1.OA.2",
    "description": "Solve word problems that call for addition of three whole numbers whose sum is less than or equal to 20, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem."
  },
  {
    "sortIndex": "28",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking.  Understand and apply properties of operations and the relationship between addition and subtraction.",
    "code": "1.OA.3",
    "description": "Apply properties of operations as strategies to add and subtract. (Students need not use formal terms for these properties.)  Examples: If 8 + 3 = 11 is known, then 3 + 8 = 11 is also known. (Commutative property of addition.) To add 2 + 6 + 4, the second two numbers can be added to make a ten, so 2 + 6 + 4 = 2 + 10 = 12. (Associative property of addition.)"
  },
  {
    "sortIndex": "29",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking.  Understand and apply properties of operations and the relationship between addition and subtraction.",
    "code": "1.OA.4",
    "description": "Understand subtraction as an unknown-addend problem.  For example, subtract 10 – 8 by finding the number that makes 10 when added to 8."
  },
  {
    "sortIndex": "30",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking. Add and subtract within 20.",
    "code": "1.OA.5",
    "description": "Relate counting to addition and subtraction (e.g., by counting on 2 to add 2)."
  },
  {
    "sortIndex": "31",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking.  Add and subtract within 20.",
    "code": "1.OA.6",
    "description": "Add and subtract within 20, demonstrating fluency for addition and subtraction within 10. Use strategies such as counting on; making ten (e.g., 8 + 6 = 8 + 2 + 4 = 10 + 4 = 14); decomposing a number leading to a ten (e.g., 13 – 4 = 13 – 3 – 1 = 10 – 1 = 9); using the relationship between addition and subtraction (e.g., knowing that 8 + 4 = 12, one knows 12 – 8 = 4); and creating equivalent but easier or known sums (e.g., adding 6 + 7 by creating the known equivalent 6 + 6 + 1 = 12 + 1 = 13)."
  },
  {
    "sortIndex": "32",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking.  Work with addition and subtraction equations.",
    "code": "1.OA.7",
    "description": "Understand the meaning of the equal sign, and determine if equations involving addition and subtraction are true or false.  For example, which of the following equations are true and which are false? 6 = 6, 7 = 8 – 1, 5 + 2 = 2 + 5, 4 + 1 = 5 + 2."
  },
  {
    "sortIndex": "33",
    "category": "Grade 1",
    "subCategory": "Operations and Algebraic Thinking.  Work with addition and subtraction equations.",
    "code": "1.OA.8",
    "description": "Determine the unknown whole number in an addition or subtraction equation relating to three whole numbers. For example, determine the unknown number that makes the equation true in each of the equations 8 + ? = 11, 5 = 􀃍 – 3, 6 + 6 = 􀃍."
  },
  {
    "sortIndex": "34",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten : . Extend the counting sequence.",
    "code": "1.NBT.1",
    "description": "Count to 120, starting at any number less than 120. In this range, read and write numerals and represent a number of objects with a written numeral."
  },
  {
    "sortIndex": "35",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Understand place value.",
    "code": "1.NBT.2",
    "description": "Understand that the two digits of a two-digit number represent amounts of tens and ones. Understand the following as special cases:"
  },
  {
    "sortIndex": "36",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Understand place value.",
    "code": "1.NBT.2 a.",
    "description": "10 can be thought of as a bundle of ten ones — called a “ten.”"
  },
  {
    "sortIndex": "37",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Understand place value.",
    "code": "1.NBT.2 b.",
    "description": "The numbers from 11 to 19 are composed of a ten and one, two, three, four, five, six, seven, eight, or nine ones."
  },
  {
    "sortIndex": "38",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Understand place value.",
    "code": "1.NBT.2 c.",
    "description": "The numbers 10, 20, 30, 40, 50, 60, 70, 80, 90 refer to one, two, three, four, five, six, seven, eight, or nine tens (and 0 ones)."
  },
  {
    "sortIndex": "39",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Understand place value.",
    "code": "1.NBT.3",
    "description": "Compare two two-digit numbers based on meanings of the tens and ones digits, recording the results of comparisons with the symbols >, =, and <."
  },
  {
    "sortIndex": "40",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Use place value understanding and properties of operations to add and subtract.",
    "code": "1.NBT4",
    "description": "Add within 100, including adding a two-digit number and a one-digit number, and adding a two-digit number and a multiple of 10, using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used. Understand that in adding two-digit numbers, one adds tens and tens, ones and ones; and sometimes it is necessary to compose a ten."
  },
  {
    "sortIndex": "41",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Use place value understanding and properties of operations to add and subtract.",
    "code": "1.NBT.5",
    "description": "Given a two-digit number, mentally find 10 more or 10 less than the number, without having to count; explain the reasoning used."
  },
  {
    "sortIndex": "42",
    "category": "Grade 1",
    "subCategory": "Number and Operations in Base Ten . Use place value understanding and properties of operations to add and subtract.",
    "code": "1.NBT.6",
    "description": "Subtract multiples of 10 in the range 10-90 from multiples of 10 in the range 10-90 (positive or zero differences), using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used."
  },
  {
    "sortIndex": "43",
    "category": "Grade 1",
    "subCategory": "Measurement and Data. Measure lengths indirectly and by iterating length units.",
    "code": "1.MD.1",
    "description": "Order three objects by length; compare the lengths of two objects indirectly by using a third object."
  },
  {
    "sortIndex": "44",
    "category": "Grade 1",
    "subCategory": "Measurement and Data. Measure lengths indirectly and by iterating length units.",
    "code": "1.MD.2",
    "description": "Express the length of an object as a whole number of length units, by laying multiple copies of a shorter object (the length unit) end to end; understand that the length measurement of an object is the number of same-size length units that span it with no gaps or overlaps. Limit to contexts where the object being measured is spanned by a whole number of length units with no gaps or overlaps."
  },
  {
    "sortIndex": "45",
    "category": "Grade 1",
    "subCategory": "Measurement and Data. Tell and write time.",
    "code": "1.MD.3",
    "description": "Tell and write time in hours and half-hours using analog and digital clocks."
  },
  {
    "sortIndex": "46",
    "category": "Grade 1",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "1.MD.4",
    "description": "Organize, represent, and interpret data with up to three categories; ask and answer questions about the total number of data points, how many in each category, and how many more or less are in one category than in another."
  },
  {
    "sortIndex": "47",
    "category": "Grade 1",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "1.G.1",
    "description": "Distinguish between defining attributes (e.g., triangles are closed and three-sided) versus non-defining attributes (e.g., color, orientation, overall size); build and draw shapes to possess defining attributes."
  },
  {
    "sortIndex": "48",
    "category": "Grade 1",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "1.G.2",
    "description": "Compose two-dimensional shapes (rectangles, squares, trapezoids, triangles, half-circles, and quarter-circles) or three-dimensional shapes (cubes, right rectangular prisms, right circular cones, and right circular cylinders) to create a composite shape, and compose new shapes from the composite shape. (Students do not need to learn formal names such as “right rectangular prism.”)"
  },
  {
    "sortIndex": "49",
    "category": "Grade 1",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "1.G.3",
    "description": "Partition circles and rectangles into two and four equal shares, describe the shares using the words halves, fourths, and quarters, and use the phrases half of, fourth of, and quarter of. Describe the whole as two of, or four of the shares. Understand for these examples that decomposing into more equal shares creates smaller shares."
  },
  {
    "sortIndex": "50",
    "category": "Grade 2",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving addition and subtraction.",
    "code": "2.OA.1",
    "description": "Use addition and subtraction within 100 to solve one- and two-step word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem. (See Glossary)"
  },
  {
    "sortIndex": "51",
    "category": "Grade 2",
    "subCategory": "Operations and Algebraic Thinking. Add and subtract within 20.",
    "code": "2.OA.2",
    "description": "Fluently add and subtract within 20 using mental strategies. (See standard 1.OA.6 for a list of mental strategies.)  By end of Grade 2, know from memory all sums of two one-digit numbers."
  },
  {
    "sortIndex": "52",
    "category": "Grade 2",
    "subCategory": "Operations and Algebraic Thinking. Work with equal groups of objects to gain foundations for multiplication.",
    "code": "2.OA.3",
    "description": "Determine whether a group of objects (up to 20) has an odd or even number of members, e.g., by pairing objects or counting them by 2s; write an equation to express an even number as a sum of two equal addends."
  },
  {
    "sortIndex": "53",
    "category": "Grade 2",
    "subCategory": "Operations and Algebraic Thinking. Work with equal groups of objects to gain foundations for multiplication.",
    "code": "2.OA.4",
    "description": "Use addition to find the total number of objects arranged in rectangular arrays with up to 5 rows and up to 5 columns; write an equation to express the total as a sum of equal addends."
  },
  {
    "sortIndex": "54",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Understand place value.",
    "code": "2.NBT.1",
    "description": "Understand that the three digits of a three-digit number represent amounts of hundreds, tens, and ones; e.g., 706 equals 7 hundreds, 0 tens, and 6 ones. Understand the following as special cases:"
  },
  {
    "sortIndex": "55",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Understand place value.",
    "code": "2.NBT.1 a.",
    "description": "100 can be thought of as a bundle of ten tens — called a “hundred.”"
  },
  {
    "sortIndex": "56",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Understand place value.",
    "code": "2.NBT.1 b.",
    "description": "The numbers 100, 200, 300, 400, 500, 600, 700, 800, 900 refer to one, two, three, four, five, six, seven, eight, or nine hundreds (and 0 tens and 0 ones)."
  },
  {
    "sortIndex": "57",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Understand place value.",
    "code": "2.NBT.2",
    "description": "Count within 1000; skip-count by 5s, 10s, and 100s."
  },
  {
    "sortIndex": "58",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Understand place value.",
    "code": "2.NBT.3",
    "description": "Read and write numbers to 1000 using base-ten numerals, number names, and expanded form."
  },
  {
    "sortIndex": "59",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Understand place value.",
    "code": "2.NBT.4",
    "description": "Compare two three-digit numbers based on meanings of the hundreds, tens, and ones digits, using >, =, and < symbols to record the results of comparisons."
  },
  {
    "sortIndex": "60",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to add and subtract.",
    "code": "2.NBT.5",
    "description": "Fluently add and subtract within 100 using strategies based on place value, properties of operations, and/or the relationship between addition and subtraction."
  },
  {
    "sortIndex": "61",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to add and subtract.",
    "code": "2.NBT.6",
    "description": "Add up to four two-digit numbers using strategies based on place value and properties of operations."
  },
  {
    "sortIndex": "62",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to add and subtract.",
    "code": "2.NBT.7",
    "description": "Add and subtract within 1000, using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method. Understand that in adding or subtracting three-digit numbers, one adds or subtracts hundreds and hundreds, tens and tens, ones and ones; and sometimes it is necessary to compose or decompose tens or hundreds."
  },
  {
    "sortIndex": "63",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to add and subtract.",
    "code": "2.NBT.8",
    "description": "Mentally add 10 or 100 to a given number 100–900, and mentally subtract 10 or 100 from a given number 100–900."
  },
  {
    "sortIndex": "64",
    "category": "Grade 2",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to add and subtract.",
    "code": "2.NBT.9",
    "description": "Explain why addition and subtraction strategies work, using place value and the properties of operations. (Explanations may be supported by drawings or objects.)"
  },
  {
    "sortIndex": "65",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Measure and estimate lengths in standard units.",
    "code": "2.MD.1",
    "description": "Measure the length of an object by selecting and using appropriate tools such as rulers, yardsticks, meter sticks, and measuring tapes."
  },
  {
    "sortIndex": "66",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Measure and estimate lengths in standard units.",
    "code": "2.MD.2",
    "description": "Measure the length of an object twice, using length units of different lengths for the two measurements; describe how the two measurements relate to the size of the unit chosen."
  },
  {
    "sortIndex": "67",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Measure and estimate lengths in standard units.",
    "code": "2.MD.3",
    "description": "Estimate lengths using units of inches, feet, centimeters, and meters."
  },
  {
    "sortIndex": "68",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Measure and estimate lengths in standard units.",
    "code": "2.MD.4",
    "description": "Measure to determine how much longer one object is than another, expressing the length difference in terms of a standard length unit."
  },
  {
    "sortIndex": "69",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Relate addition and subtraction to length.",
    "code": "2.MD.5",
    "description": "Use addition and subtraction within 100 to solve word problems involving lengths that are given in the same units, e.g., by using drawings (such as drawings of rulers) and equations with a symbol for the unknown number to represent the problem."
  },
  {
    "sortIndex": "70",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Relate addition and subtraction to length.",
    "code": "2.MD.6",
    "description": "Represent whole numbers as lengths from 0 on a number line diagram with equally spaced points corresponding to the numbers 0, 1, 2, ..., and represent whole-number sums and differences within 100 on a number line diagram."
  },
  {
    "sortIndex": "71",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Work with time and money.",
    "code": "2.MD.7",
    "description": "Tell and write time from analog and digital clocks to the nearest five minutes, using a.m. and p.m."
  },
  {
    "sortIndex": "72",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Work with time and money.",
    "code": "2.MD.8",
    "description": "Solve word problems involving dollar bills, quarters, dimes, nickels, and pennies, using $ and ¢ symbols appropriately.  Example: If you have 2 dimes and 3 pennies, how many cents do you have?"
  },
  {
    "sortIndex": "73",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "2.MD.9",
    "description": "Generate measurement data by measuring lengths of several objects to the nearest whole unit, or by making repeated measurements of the same object. Show the measurements by making a line plot, where the horizontal scale is marked off in whole-number units."
  },
  {
    "sortIndex": "74",
    "category": "Grade 2",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "2.MD.10",
    "description": "Draw a picture graph and a bar graph (with single-unit scale) to represent a data set with up to four categories. Solve simple put together, take-apart, and compare problems (See Glossary) using information presented in a bar graph."
  },
  {
    "sortIndex": "75",
    "category": "Grade 2",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "2.G.1",
    "description": "Recognize and draw shapes having specified attributes, such as a given number of angles or a given number of equal faces. (Sizes are compared directly or visually, not compared by measuring.)  Identify triangles, quadrilaterals, pentagons, hexagons, and cubes."
  },
  {
    "sortIndex": "76",
    "category": "Grade 2",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "2.G.2",
    "description": "Partition a rectangle into rows and columns of same-size squares and count to find the total number of them."
  },
  {
    "sortIndex": "77",
    "category": "Grade 2",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "2.G.3",
    "description": "Partition circles and rectangles into two, three, or four equal shares, describe the shares using the words halves, thirds, half of, a third of, etc., and describe the whole as two halves, three thirds, four fourths. Recognize that equal shares of identical wholes need not have the same shape."
  },
  {
    "sortIndex": "78",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving multiplication and division.",
    "code": "3.OA.1",
    "description": "Interpret products of whole numbers, e.g., interpret 5 × 7 as the total number of objects in 5 groups of 7 objects each. For example, describe a context in which a total number of objects can be expressed as 5 × 7."
  },
  {
    "sortIndex": "79",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving multiplication and division.",
    "code": "3.OA.2",
    "description": "Interpret whole-number quotients of whole numbers, e.g., interpret 56 ÷ 8 as the number of objects in each share when 56 objects are partitioned equally into 8 shares, or as a number of shares when 56 objects are partitioned into equal shares of 8 objects each.  For example, describe a context in which a number of shares or a number of groups can be expressed as 56 ÷ 8."
  },
  {
    "sortIndex": "80",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving multiplication and division.",
    "code": "3.OA.3",
    "description": "Use multiplication and division within 100 to solve word problems in situations involving equal groups, arrays, and measurement quantities, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem.  (See Glossary)"
  },
  {
    "sortIndex": "81",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Represent and solve problems involving multiplication and division.",
    "code": "3.OA.4",
    "description": "Determine the unknown whole number in a multiplication or division equation relating three whole numbers.  For example, determine the unknown number that makes the equation true in each of the equations 8 × ? = 48, 5 = 􀃍 ÷ 3, 6 × 6 = ?."
  },
  {
    "sortIndex": "82",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Understand properties of multiplication and the relationship between multiplication and division.",
    "code": "3.OA.5",
    "description": "Apply properties of operations as strategies to multiply and divide. (Students need not use formal terms for these properties.)  Examples: If 6 × 4 = 24 is known, then 4 × 6 = 24 is also known. (Commutative property of multiplication.) 3 × 5 × 2 can be found by 3 × 5 = 15, then 15 × 2 = 30, or by 5 × 2 = 10, then 3 × 10 = 30. (Associative property of multiplication.) Knowing that 8 × 5 = 40 and 8 × 2 = 16, one can find 8 × 7 as 8 × (5 + 2) = (8 × 5) + (8 × 2) = 40 + 16 = 56. (Distributive property.)"
  },
  {
    "sortIndex": "83",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Understand properties of multiplication and the relationship between multiplication and division.",
    "code": "3.OA.6",
    "description": "Understand division as an unknown-factor problem.  For example, find 32 ÷ 8 by finding the number that makes 32 when multiplied by 8."
  },
  {
    "sortIndex": "84",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Multiply and divide within 100.",
    "code": "3.OA.7",
    "description": "Fluently multiply and divide within 100, using strategies such as the relationship between multiplication and division (e.g., knowing that 8 × 5 = 40, one knows 40 ÷ 5 = 8) or properties of operations. By the end of Grade 3, know from memory all products of two one-digit numbers."
  },
  {
    "sortIndex": "85",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Solve problems involving the four operations, and identify and explain patterns in arithmetic.",
    "code": "3.OA.8",
    "description": "Solve two-step word problems using the four operations. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding.  (This standard is limited to problems posed with whole numbers and having whole number answers; students should know how to perform operations in the conventional order when there are no parentheses to specify a particular order (Order of Operations).)"
  },
  {
    "sortIndex": "86",
    "category": "Grade 3",
    "subCategory": "Operations and Algebraic Thinking. Solve problems involving the four operations, and identify and explain patterns in arithmetic.",
    "code": "3.OA.9",
    "description": "Identify arithmetic patterns (including patterns in the addition table or multiplication table), and explain them using properties of operations.  For example, observe that 4 times a number is always even, and explain why 4 times a number can be decomposed into two equal addends."
  },
  {
    "sortIndex": "87",
    "category": "Grade 3",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to perform multi-digit arithmetic. (A range of algorithms may be used.)",
    "code": "3.NBT.1",
    "description": "Use place value understanding to round whole numbers to the nearest 10 or 100."
  },
  {
    "sortIndex": "88",
    "category": "Grade 3",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to perform multi-digit arithmetic. (A range of algorithms may be used.)",
    "code": "3.NBT.2",
    "description": "Fluently add and subtract within 1000 using strategies and algorithms based on place value, properties of operations, and/or the relationship between addition and subtraction."
  },
  {
    "sortIndex": "89",
    "category": "Grade 3",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to perform multi-digit arithmetic. (A range of algorithms may be used.)",
    "code": "3.NBT.3",
    "description": "Multiply one-digit whole numbers by multiples of 10 in the range 10–90 (e.g., 9 × 80, 5 × 60) using strategies based on place value and properties of operations."
  },
  {
    "sortIndex": "90",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.1",
    "description": "Understand a fraction 1/b as the quantity formed by 1 part when a whole is partitioned into b equal parts; understand a fraction a/b as the quantity formed by a parts of size 1/b."
  },
  {
    "sortIndex": "91",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.2",
    "description": "Understand a fraction as a number on the number line; represent fractions on a number line diagram."
  },
  {
    "sortIndex": "92",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.2 a.",
    "description": "Represent a fraction 1/b on a number line diagram by defining the interval from 0 to 1 as the whole and partitioning it into b equal parts. Recognize that each part has size 1/b and that the endpoint of the part based at 0 locates the number 1/b on the number line."
  },
  {
    "sortIndex": "93",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.2 b.",
    "description": "Represent a fraction a/b on a number line diagram by marking off a lengths 1/b from 0. Recognize that the resulting interval has size a/b and that its endpoint locates the number a/b on the number line."
  },
  {
    "sortIndex": "94",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.3",
    "description": "Explain equivalence of fractions in special cases, and compare fractions by reasoning about their size."
  },
  {
    "sortIndex": "95",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.3 a.",
    "description": "Understand two fractions as equivalent (equal) if they are the same size, or the same point on a number line."
  },
  {
    "sortIndex": "96",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.3 b.",
    "description": "Recognize and generate simple equivalent fractions, e.g., 1/2 = 2/4, 4/6 = 2/3). Explain why the fractions are equivalent, e.g., by using a visual fraction model."
  },
  {
    "sortIndex": "97",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.3 c.",
    "description": "Express whole numbers as fractions, and recognize fractions that are equivalent to whole numbers.  Examples: Express 3 in the form 3 = 3/1; recognize that 6/1 = 6; locate 4/4 and 1 at the same point of a number line diagram."
  },
  {
    "sortIndex": "98",
    "category": "Grade 3",
    "subCategory": "Number and Operations - Fractions. Develop Understanding of fractions as numbers.",
    "code": "3.NF.3 d.",
    "description": "Compare two fractions with the same numerator or the same denominator by reasoning about their size. Recognize that comparisons are valid only when the two fractions refer to the same whole. Record the results of comparisons with the symbols >, =, or <, and justify the conclusions, e.g., by using a visual fraction model."
  },
  {
    "sortIndex": "99",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Solve problems involving measurement and estimation of intervals of time, liquid volumes, and masses of objects.",
    "code": "3.MD.1",
    "description": "Tell and write time to the nearest minute and measure time intervals in minutes. Solve word problems involving addition and subtraction of time intervals in minutes, e.g., by representing the problem on a number line diagram."
  },
  {
    "sortIndex": "100",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Solve problems involving measurement and estimation of intervals of time, liquid volumes, and masses of objects.",
    "code": "3.MD.2",
    "description": "Measure and estimate liquid volumes and masses of objects using standard units of grams (g), kilograms (kg), and liters (l). (Excludes compound units such as cm3 and finding the geometric volume of a container.)  Add, subtract, multiply, or divide to solve one-step word problems involving masses or volumes that are given in the same units, e.g., by using drawings (such as a beaker with a measurement scale) to represent the problem. [Excludes multiplicative comparison problems (problems involving notions of “times as much”; see Glossary, Table 2])"
  },
  {
    "sortIndex": "101",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "3.MD.3",
    "description": "Draw a scaled picture graph and a scaled bar graph to represent a data set with several categories. Solve one- and two-step “how many more” and “how many less” problems using information presented in scaled bar graphs.  For example, draw a bar graph in which each square in the bar graph might represent 5 pets."
  },
  {
    "sortIndex": "102",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "3.MD.4",
    "description": "Generate measurement data by measuring lengths using rulers marked with halves and fourths of an inch. Show the data by making a line plot, where the horizontal scale is marked off in appropriate units— whole numbers, halves, or quarters."
  },
  {
    "sortIndex": "103",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.5",
    "description": "Recognize area as an attribute of plane figures and understand concepts of area measurement."
  },
  {
    "sortIndex": "104",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.5 a.",
    "description": "A square with side length 1 unit, called “a unit square,” is said to have “one square unit” of area, and can be used to measure area."
  },
  {
    "sortIndex": "105",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.5 b.",
    "description": "A plane figure which can be covered without gaps or overlaps by n unit squares is said to have an area of n square units."
  },
  {
    "sortIndex": "106",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Measurement and Data: Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.6",
    "description": "Measure areas by counting unit squares (square cm, square m, square in, square ft, and improvised units)."
  },
  {
    "sortIndex": "107",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.7",
    "description": "Relate area to the operations of multiplication and addition."
  },
  {
    "sortIndex": "108",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.7 a.",
    "description": "Find the area of a rectangle with whole-number side lengths by tiling it, and show that the area is the same as would be found by multiplying the side lengths."
  },
  {
    "sortIndex": "109",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.7 b.",
    "description": "Multiply side lengths to find areas of rectangles with whole number side lengths in the context of solving real world and mathematical problems, and represent whole-number products as rectangular areas in mathematical reasoning."
  },
  {
    "sortIndex": "110",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.7 c.",
    "description": "Use tiling to show in a concrete case that the area of a rectangle with whole-number side lengths a and b + c is the sum of a × b and a × c. Use area models to represent the distributive property in mathematical reasoning."
  },
  {
    "sortIndex": "111",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of area and relate area to multiplication and to addition.",
    "code": "3.MD.7 d.",
    "description": "Recognize area as additive. Find areas of rectilinear figures by decomposing them into non-overlapping rectangles and adding the areas of the non-overlapping parts, applying this technique to solve real world problems."
  },
  {
    "sortIndex": "112",
    "category": "Grade 3",
    "subCategory": "Measurement and Data. Geometric measurement: recognize perimeter as an attribute of plane figures and distinguish between linear and area measures.",
    "code": "3.MD.8",
    "description": "Solve real world and mathematical problems involving perimeters of polygons, including finding the perimeter given the side lengths, finding an unknown side length, and exhibiting rectangles with the same perimeter and different areas or with the same area and different perimeters."
  },
  {
    "sortIndex": "113",
    "category": "Grade 3",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "3.G.1",
    "description": "Understand that shapes in different categories (e.g., rhombuses, rectangles, and others) may share attributes (e.g., having four sides), and that the shared attributes can define a larger category (e.g., quadrilaterals). Recognize rhombuses, rectangles, and squares as examples of quadrilaterals, and draw examples of quadrilaterals that do not belong to any of these subcategories."
  },
  {
    "sortIndex": "114",
    "category": "Grade 3",
    "subCategory": "Geometry. Reason with shapes and their attributes.",
    "code": "3.G.2",
    "description": "Partition shapes into parts with equal areas. Express the area of each part as a unit fraction of the whole.  For example, partition a shape into 4 parts with equal area, and describe the area of each part as 1/4 of the area of the shape."
  },
  {
    "sortIndex": "115",
    "category": "Grade 4",
    "subCategory": "Operations and Algebraic Thinking. Use the four operations with whole numbers to solve problems.",
    "code": "4.OA.1",
    "description": "Interpret a multiplication equation as a comparison, e.g., interpret 35 = 5 × 7 as a statement that 35 is 5 times as many as 7 and 7 times as many as 5. Represent verbal statements of multiplicative comparisons as multiplication equations."
  },
  {
    "sortIndex": "116",
    "category": "Grade 4",
    "subCategory": "Operations and Algebraic Thinking. Use the four operations with whole numbers to solve problems.",
    "code": "4.OA.2",
    "description": "Multiply or divide to solve word problems involving multiplicative comparison, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem, distinguishing multiplicative comparison from additive comparison. (See Glossary)"
  },
  {
    "sortIndex": "117",
    "category": "Grade 4",
    "subCategory": "Operations and Algebraic Thinking. Use the four operations with whole numbers to solve problems.",
    "code": "4.OA.3",
    "description": "Solve multistep word problems posed with whole numbers and having whole-number answers using the four operations, including problems in which remainders must be interpreted. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding."
  },
  {
    "sortIndex": "118",
    "category": "Grade 4",
    "subCategory": "Operations and Algebraic Thinking. Gain familiarity with factors and multiples.",
    "code": "4.OA.4",
    "description": "Find all factor pairs for a whole number in the range 1–100. Recognize that a whole number is a multiple of each of its factors. Determine whether a given whole number in the range 1–100 is a multiple of a given one-digit number. Determine whether a given whole number in the range 1–100 is prime or composite."
  },
  {
    "sortIndex": "119",
    "category": "Grade 4",
    "subCategory": "Operations and Algebraic Thinking. Generate and analyze patterns.",
    "code": "4.OA.5",
    "description": "Generate a number or shape pattern that follows a given rule. Identify apparent features of the pattern that were not explicit in the rule itself.  For example, given the rule “Add 3” and the starting number 1, generate terms in the resulting sequence and observe that the terms appear to alternate between odd and even numbers. Explain informally why the numbers will continue to alternate in this way."
  },
  {
    "sortIndex": "120",
    "category": "Grade 4",
    "subCategory": "Number and Operations in Base Ten.  Generalize place value understanding for multi-digit whole numbers.",
    "code": "4.NBT.1",
    "description": "Recognize that in a multi-digit whole number, a digit in one place represents ten times what it represents in the place to its right. For example, recognize that 700 ÷ 70 = 10 by applying concepts of place value and division."
  },
  {
    "sortIndex": "121",
    "category": "Grade 4",
    "subCategory": "Number and Operations in Base Ten. Generalize place value understanding for multi-digit whole numbers.",
    "code": "4.NBT.2",
    "description": "Read and write multi-digit whole numbers using base-ten numerals, number names, and expanded form. Compare two multi-digit numbers based on meanings of the digits in each place, using >, =, and < symbols to record the results of comparisons."
  },
  {
    "sortIndex": "122",
    "category": "Grade 4",
    "subCategory": "Number and Operations in Base Ten. Generalize place value understanding for multi-digit whole numbers.",
    "code": "4.NBT.3",
    "description": "Use place value understanding to round multi-digit whole numbers to any place."
  },
  {
    "sortIndex": "123",
    "category": "Grade 4",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to perform multi-digit arithmetic.",
    "code": "4.NBT.4",
    "description": "Fluently add and subtract multi-digit whole numbers using the standard algorithm."
  },
  {
    "sortIndex": "124",
    "category": "Grade 4",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to perform multi-digit arithmetic.",
    "code": "4.NBT.5",
    "description": "Multiply a whole number of up to four digits by a one-digit whole number, and multiply two two-digit numbers, using strategies based on place value and the properties of operations. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."
  },
  {
    "sortIndex": "125",
    "category": "Grade 4",
    "subCategory": "Number and Operations in Base Ten. Use place value understanding and properties of operations to perform multi-digit arithmetic.",
    "code": "4.NBT.6",
    "description": "Find whole-number quotients and remainders with up to four-digit dividends and one-digit divisors, using strategies based on place value, the properties of operations, and/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."
  },
  {
    "sortIndex": "126",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Extend understanding of fraction equivalence and ordering.",
    "code": "4.NF.1",
    "description": "Explain why a fraction a/b is equivalent to a fraction (n × a)/(n × b) by using visual fraction models, with attention to how the number and size of the parts differ even though the two fractions themselves are the same size. Use this principle to recognize and generate equivalent fractions."
  },
  {
    "sortIndex": "127",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Extend understanding of fraction equivalence and ordering.",
    "code": "4.NF.2",
    "description": "Compare two fractions with different numerators and different denominators, e.g., by creating common denominators or numerators, or by comparing to a benchmark fraction such as 1/2. Recognize that comparisons are valid only when the two fractions refer to the same whole. Record the results of comparisons with symbols >, =, or <, and justify the conclusions, e.g., by using a visual fraction model."
  },
  {
    "sortIndex": "128",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.3",
    "description": "Understand a fraction a/b with a > 1 as a sum of fractions 1/b."
  },
  {
    "sortIndex": "129",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.3 a.",
    "description": "Understand addition and subtraction of fractions as joining and separating parts referring to the same whole."
  },
  {
    "sortIndex": "130",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.3 b.",
    "description": "Decompose a fraction into a sum of fractions with the same denominator in more than one way, recording each decomposition by an equation. Justify decompositions, e.g., by using a visual fraction model.  Examples: 3/8 = 1/8 + 1/8 + 1/8 ; 3/8 = 1/8 + 2/8 ; 2 1/8 = 1 + 1 + 1/8 = 8/8 + 8/8 + 1/8."
  },
  {
    "sortIndex": "131",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.3 c.",
    "description": "Add and subtract mixed numbers with like denominators, e.g., by replacing each mixed number with an equivalent fraction, and/or by using properties of operations and the relationship between addition and subtraction."
  },
  {
    "sortIndex": "132",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.3 d.",
    "description": "Solve word problems involving addition and subtraction of fractions referring to the same whole and having like denominators, e.g., by using visual fraction models and equations to represent the problem."
  },
  {
    "sortIndex": "133",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.4",
    "description": "Apply and extend previous understandings of multiplication to multiply a fraction by a whole number."
  },
  {
    "sortIndex": "134",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.4 a.",
    "description": "Understand a fraction a/b as a multiple of 1/b.  For example, use a visual fraction model to represent 5/4 as the product 5 × (1/4), recording the conclusion by the equation 5/4 = 5 × (1/4)."
  },
  {
    "sortIndex": "135",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.4 b.",
    "description": "Understand a multiple of a/b as a multiple of 1/b, and use this understanding to multiply a fraction by a whole number.  For example, use a visual fraction model to express 3 × (2/5) as 6 × (1/5), recognizing this product as 6/5. (In general, n × (a/b) = (n × a)/b.)"
  },
  {
    "sortIndex": "136",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers.",
    "code": "4.NF.4 c.",
    "description": "Solve word problems involving multiplication of a fraction by a whole number, e.g., by using visual fraction models and equations to represent the problem.  For example, if each person at a party will eat 3/8 of a pound of roast beef, and there will be 5 people at the party, how many pounds of roast beef will be needed? Between what two whole numbers does your answer lie?"
  },
  {
    "sortIndex": "137",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Understand decimal notation for fractions, and compare decimal fractions.",
    "code": "4.NF.5",
    "description": "Express a fraction with denominator 10 as an equivalent fraction with denominator 100, and use this technique to add two fractions with respective denominators 10 and 100. (Students who can generate equivalent fractions can develop strategies for adding fractions with unlike denominators in general. But addition and subtraction with unlike denominators in general is not a requirement at this grade.)  For example, express 3/10 as 30/100, and add 3/10 + 4/100 = 34/100."
  },
  {
    "sortIndex": "138",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Understand decimal notation for fractions, and compare decimal fractions.",
    "code": "4.NF.6",
    "description": "Use decimal notation for fractions with denominators 10 or 100.  For example, rewrite 0.62 as 62/100; describe a length as 0.62 meters; locate 0.62 on a number line diagram."
  },
  {
    "sortIndex": "139",
    "category": "Grade 4",
    "subCategory": "Number and Operations - Fractions. Understand decimal notation for fractions, and compare decimal fractions.",
    "code": "4.NF.7",
    "description": "Compare two decimals to hundredths by reasoning about their size. Recognize that comparisons are valid only when the two decimals refer to the same whole. Record the results of comparisons with the symbols >, =, or <, and justify the conclusions, e.g., by using a visual model."
  },
  {
    "sortIndex": "140",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Solve problems involving measurement and conversion of measurements from a larger unit to a smaller unit.",
    "code": "4.MD.1",
    "description": "Know relative sizes of measurement units within one system of units including km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec. Within a single system of measurement, express measurements in a larger unit in terms of a smaller unit. Record measurement equivalents in a two column table. For example, know that 1 ft is 12 times as long as 1 in. Express the length of a 4 ft snake as 48 in. Generate a conversion table for feet and inches listing the number pairs (1, 12), (2, 24), (3, 36), ..."
  },
  {
    "sortIndex": "141",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Solve problems involving measurement and conversion of measurements from a larger unit to a smaller unit.",
    "code": "4.MD.2",
    "description": "Use the four operations to solve word problems involving distances, intervals of time, liquid volumes, masses of objects, and money, including problems involving simple fractions or decimals, and problems that require expressing measurements given in a larger unit in terms of a smaller unit. Represent measurement quantities using diagrams such as number line diagrams that feature a measurement scale."
  },
  {
    "sortIndex": "142",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Solve problems involving measurement and conversion of measurements from a larger unit to a smaller unit.",
    "code": "4.MD.3",
    "description": "Apply the area and perimeter formulas for rectangles in real world and mathematical problems.  For example, find the width of a rectangular room given the area of the flooring and the length, by viewing the area formula as a multiplication equation with an unknown factor."
  },
  {
    "sortIndex": "143",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "4.MD.4",
    "description": "Make a line plot to display a data set of measurements in fractions of a unit (1/2, 1/4, 1/8). Solve problems involving addition and subtraction of fractions by using information presented in line plots. For example, from a line plot find and interpret the difference in length between the longest and shortest specimens in an insect collection."
  },
  {
    "sortIndex": "144",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of angle and measure angles.",
    "code": "4.MD.5",
    "description": "Recognize angles as geometric shapes that are formed wherever two rays share a common endpoint, and understand concepts of angle measurement:"
  },
  {
    "sortIndex": "145",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of angle and measure angles.",
    "code": "4.MD.5 a.",
    "description": "An angle is measured with reference to a circle with its center at the common endpoint of the rays, by considering the fraction of the circular arc between the points where the two rays intersect the circle. An angle that turns through 1/360 of a circle is called a “one-degree angle,” and can be used to measure angles."
  },
  {
    "sortIndex": "146",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of angle and measure angles.",
    "code": "4.MD.5 b.",
    "description": "An angle that turns through n one-degree angles is said to have an angle measure of n degrees."
  },
  {
    "sortIndex": "147",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of angle and measure angles.",
    "code": "4.MD.6",
    "description": "Measure angles in whole-number degrees using a protractor. Sketch angles of specified measure."
  },
  {
    "sortIndex": "148",
    "category": "Grade 4",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of angle and measure angles.",
    "code": "4.MD.7",
    "description": "Recognize angle measure as additive. When an angle is decomposed into non-overlapping parts, the angle measure of the whole is the sum of the angle measures of the parts. Solve addition and subtraction problems to find unknown angles on a diagram in real world and mathematical problems, e.g., by using an equation with a symbol for the unknown angle measure."
  },
  {
    "sortIndex": "149",
    "category": "Grade 4",
    "subCategory": "Geometry. Draw and identify lines and angles, and classify shapes by properties of their lines and angles.",
    "code": "4.G.1",
    "description": "Draw points, lines, line segments, rays, angles (right, acute, obtuse), and perpendicular and parallel lines. Identify these in two-dimensional figures."
  },
  {
    "sortIndex": "150",
    "category": "Grade 4",
    "subCategory": "Geometry. Draw and identify lines and angles, and classify shapes by properties of their lines and angles.",
    "code": "4.G.2",
    "description": "Classify two-dimensional figures based on the presence or absence of parallel or perpendicular lines, or the presence or absence of angles of a specified size. Recognize right triangles as a category, and identify right triangles."
  },
  {
    "sortIndex": "151",
    "category": "Grade 4",
    "subCategory": "Geometry. Draw and identify lines and angles, and classify shapes by properties of their lines and angles.",
    "code": "4.G.3",
    "description": "Recognize a line of symmetry for a two-dimensional figure as a line across the figure such that the figure can be folded along the line into matching parts. Identify line-symmetric figures and draw lines of symmetry."
  },
  {
    "sortIndex": "152",
    "category": "Grade 5",
    "subCategory": "Operations and Algebraic Thinking. Write and interpret numerical expressions.",
    "code": "5.OA.1",
    "description": "Use parentheses, brackets, or braces in numerical expressions, and evaluate expressions with these symbols."
  },
  {
    "sortIndex": "153",
    "category": "Grade 5",
    "subCategory": "Operations and Algebraic Thinking. Write and interpret numerical expressions.",
    "code": "5.OA.2",
    "description": "Write simple expressions that record calculations with numbers, and interpret numerical expressions without evaluating them.  For example, express the calculation “add 8 and 7, then multiply by 2” as 2 × (8 + 7). Recognize that 3 × (18932 + 921) is three times as large as 18932 + 921, without having to calculate the indicated sum or product."
  },
  {
    "sortIndex": "154",
    "category": "Grade 5",
    "subCategory": "Operations and Algebraic Thinking.  Analyze patterns and relationships.",
    "code": "5.OA.3",
    "description": "Generate two numerical patterns using two given rules. Identify apparent relationships between corresponding terms. Form ordered pairs consisting of corresponding terms from the two patterns, and graph the ordered pairs on a coordinate plane.  For example, given the rule “Add 3” and the starting number 0, and given the rule “Add 6” and the starting number 0, generate terms in the resulting sequences, and observe that the terms in one sequence are twice the corresponding terms in the other sequence. Explain informally why this is so."
  },
  {
    "sortIndex": "155",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Understand the place value system.",
    "code": "5.NBT.1",
    "description": "Recognize that in a multi-digit number, a digit in one place represents 10 times as much as it represents in the place to its right and 1/10 of what it represents in the place to its left."
  },
  {
    "sortIndex": "156",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Understand the place value system.",
    "code": "5.NBT.2",
    "description": "Explain patterns in the number of zeros of the product when multiplying a number by powers of 10, and explain patterns in the placement of the decimal point when a decimal is multiplied or divided by a power of 10. Use whole-number exponents to denote powers of 10."
  },
  {
    "sortIndex": "157",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Understand the place value system.",
    "code": "5.NBT.3",
    "description": "Read, write, and compare decimals to thousandths."
  },
  {
    "sortIndex": "158",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Understand the place value system.",
    "code": "5.NBT.3 a.",
    "description": "Read and write decimals to thousandths using base-ten numerals, number names, and expanded form, e.g., 347.392 = 3 × 100 + 4 × 10 + 7 × 1 + 3 × (1/10) + 9 × (1/100) + 2 × (1/1000)."
  },
  {
    "sortIndex": "159",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Understand the place value system.",
    "code": "5.NBT.3 b.",
    "description": "Compare two decimals to thousandths based on meanings of the digits in each place, using >, =, and < symbols to record the results of comparisons."
  },
  {
    "sortIndex": "160",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Understand the place value system.",
    "code": "5.NBT.4",
    "description": "Use place value understanding to round decimals to any place."
  },
  {
    "sortIndex": "161",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Perform operations with multi-digit whole numbers and with decimals to hundredths.",
    "code": "5.NBT.5",
    "description": "Fluently multiply multi-digit whole numbers using the standard algorithm."
  },
  {
    "sortIndex": "162",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Perform operations with multi-digit whole numbers and with decimals to hundredths.",
    "code": "5.NBT.6",
    "description": "Find whole-number quotients of whole numbers with up to four-digit dividends and two-digit divisors, using strategies based on place value, the properties of operations, and/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."
  },
  {
    "sortIndex": "163",
    "category": "Grade 5",
    "subCategory": "Number and Operations in Base Ten. Perform operations with multi-digit whole numbers and with decimals to hundredths.",
    "code": "5.NBT.7",
    "description": "Add, subtract, multiply, and divide decimals to hundredths, using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used."
  },
  {
    "sortIndex": "164",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Use equivalent fractions as a strategy to add and subtract fractions.",
    "code": "5.NF.1",
    "description": "Add and subtract fractions with unlike denominators (including mixed numbers) by replacing given fractions with equivalent fractions in such a way as to produce an equivalent sum or difference of fractions with like denominators.  For example, 2/3 + 5/4 = 8/12 + 15/12 = 23/12. (In general, a/b + c/d = (ad + bc)/bd.)"
  },
  {
    "sortIndex": "165",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Use equivalent fractions as a strategy to add and subtract fractions.",
    "code": "5.NF.2",
    "description": "Solve word problems involving addition and subtraction of fractions referring to the same whole, including cases of unlike denominators, e.g., by using visual fraction models or equations to represent the problem. Use benchmark fractions and number sense of fractions to estimate mentally and assess the reasonableness of answers.  For example, recognize an incorrect result 2/5 + 1/2 = 3/7, by observing that 3/7 < 1/2."
  },
  {
    "sortIndex": "166",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.3",
    "description": "Interpret a fraction as division of the numerator by the denominator (a/b = a ÷ b). Solve word problems involving division of whole numbers leading to answers in the form of fractions or mixed numbers, e.g., by using visual fraction models or equations to represent the problem.  For example, interpret 3/4 as the result of dividing 3 by 4, noting that 3/4 multiplied by 4 equals 3, and that when 3 wholes are shared equally among 4 people each person has a share of size 3/4. If 9 people want to share a 50-pound sack of rice equally by weight, how many pounds of rice should each person get? Between what two whole numbers does your answer lie?"
  },
  {
    "sortIndex": "167",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.4",
    "description": "Apply and extend previous understandings of multiplication to multiply a fraction or whole number by a fraction."
  },
  {
    "sortIndex": "168",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.4 a.",
    "description": "Interpret the product (a/b) × q as a parts of a partition of q into b equal parts; equivalently, as the result of a sequence of operations a × q ÷ b.  For example, use a visual fraction model to show (2/3) × 4 = 8/3, and create a story context for this equation. Do the same with (2/3) × (4/5) = 8/15. (In general, (a/b) × (c/d) = ac/bd.)"
  },
  {
    "sortIndex": "169",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.4 b.",
    "description": "Find the area of a rectangle with fractional side lengths by tiling it with unit squares of the appropriate unit fraction side lengths, and show that the area is the same as would be found by multiplying the side lengths. Multiply fractional side lengths to find areas of rectangles, and represent fraction products as rectangular areas."
  },
  {
    "sortIndex": "170",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.5",
    "description": "Interpret multiplication as scaling (resizing), by:"
  },
  {
    "sortIndex": "171",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.5 a.",
    "description": "Comparing the size of a product to the size of one factor on the basis of the size of the other factor, without performing the indicated multiplication."
  },
  {
    "sortIndex": "172",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.5 b.",
    "description": "Explaining why multiplying a given number by a fraction greater than 1 results in a product greater than the given number (recognizing multiplication by whole numbers greater than 1 as a familiar case); explaining why multiplying a given number by a fraction less than 1 results in a product smaller than the given number; and relating the principle of fraction equivalence a/b = (n×a)/(n×b) to the effect of multiplying a/b by 1."
  },
  {
    "sortIndex": "173",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.6",
    "description": "Solve real world problems involving multiplication of fractions and mixed numbers, e.g., by using visual fraction models or equations to represent the problem."
  },
  {
    "sortIndex": "174",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.7",
    "description": "Apply and extend previous understandings of division to divide unit fractions by whole numbers and whole numbers by unit fractions. (Students able to multiply fractions in general can develop strategies to divide fractions in general, by reasoning about the relationship between multiplication and division. But division of a fraction by a fraction is not a requirement at this grade.)"
  },
  {
    "sortIndex": "175",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.7 a.",
    "description": "Interpret division of a unit fraction by a non-zero whole number, and compute such quotients.  For example, create a story context for (1/3) ÷ 4, and use a visual fraction model to show the quotient. Use the relationship between multiplication and division to explain that (1/3) ÷ 4 = 1/12 because (1/12) × 4 = 1/3."
  },
  {
    "sortIndex": "176",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.7 b.",
    "description": "Interpret division of a whole number by a unit fraction, and compute such quotients.  For example, create a story context for 4 ÷ (1/5), and use a visual fraction model to show the quotient. Use the relationship between multiplication and division to explain that 4 ÷ (1/5) = 20 because 20 × (1/5) = 4."
  },
  {
    "sortIndex": "177",
    "category": "Grade 5",
    "subCategory": "Number and Operations - Fractions. Apply and extend previous understandings of multiplication and division to multiply and divide fractions.",
    "code": "5.NF.7 c.",
    "description": "Solve real world problems involving division of unit fractions by non-zero whole numbers and division of whole numbers by unit fractions, e.g., by using visual fraction models and equations to represent the problem.  For example, how much chocolate will each person get if 3 people share 1/2 lb of chocolate equally? How many 1/3-cup servings are in 2 cups of raisins?"
  },
  {
    "sortIndex": "178",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Convert like measurement units within a given measurement system.",
    "code": "5.MD.1",
    "description": "Convert among different-sized standard measurement units within a given measurement system (e.g., convert 5 cm to 0.05 m), and use these conversions in solving multi-step, real world problems."
  },
  {
    "sortIndex": "179",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Represent and interpret data.",
    "code": "5.MD.2",
    "description": "Make a line plot to display a data set of measurements in fractions of a unit (1/2, 1/4, 1/8). Use operations on fractions for this grade to solve problems involving information presented in line plots.  For example, given different measurements of liquid in identical beakers, find the amount of liquid each beaker would contain if the total amount in all the beakers were redistributed equally."
  },
  {
    "sortIndex": "180",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.3",
    "description": "Recognize volume as an attribute of solid figures and understand concepts of volume measurement."
  },
  {
    "sortIndex": "181",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.3 a.",
    "description": "A cube with side length 1 unit, called a “unit cube,” is said to have “one cubic unit” of volume, and can be used to measure volume."
  },
  {
    "sortIndex": "182",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.3 b.",
    "description": "A solid figure which can be packed without gaps or overlaps using n unit cubes is said to have a volume of n cubic units."
  },
  {
    "sortIndex": "183",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.4",
    "description": "Measure volumes by counting unit cubes, using cubic cm, cubic in, cubic ft, and improvised units."
  },
  {
    "sortIndex": "184",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.5",
    "description": "Relate volume to the operations of multiplication and addition and solve real world and mathematical problems involving volume."
  },
  {
    "sortIndex": "185",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.5 a.",
    "description": "Find the volume of a right rectangular prism with whole-number side lengths by packing it with unit cubes, and show that the volume is the same as would be found by multiplying the edge lengths, equivalently by multiplying the height by the area of the base. Represent threefold whole-number products as volumes, e.g., to represent the associative property of multiplication."
  },
  {
    "sortIndex": "186",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.5 b.",
    "description": "Apply the formulas V = l × w × h and V = b × h for rectangular prisms to find volumes of right rectangular prisms with whole number edge lengths in the context of solving real world and mathematical problems."
  },
  {
    "sortIndex": "187",
    "category": "Grade 5",
    "subCategory": "Measurement and Data. Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition.",
    "code": "5.MD.5 c.",
    "description": "Recognize volume as additive. Find volumes of solid figures composed of two non-overlapping right rectangular prisms by adding the volumes of the non-overlapping parts, applying this technique to solve real world problems."
  },
  {
    "sortIndex": "188",
    "category": "Grade 5",
    "subCategory": "Geometry. Graph points on the coordinate plane to solve real-world and mathematical problems.",
    "code": "5.G.1",
    "description": "Use a pair of perpendicular number lines, called axes, to define a coordinate system, with the intersection of the lines (the origin) arranged to coincide with the 0 on each line and a given point in the plane located by using an ordered pair of numbers, called its coordinates. Understand that the first number indicates how far to travel from the origin in the direction of one axis, and the second number indicates how far to travel in the direction of the second axis, with the convention that the names of the two axes and the coordinates correspond (e.g., x-axis and x-coordinate, y-axis and y-coordinate)."
  },
  {
    "sortIndex": "189",
    "category": "Grade 5",
    "subCategory": "Geometry. Graph points on the coordinate plane to solve real-world and mathematical problems.",
    "code": "5.G.2",
    "description": "Represent real world and mathematical problems by graphing points in the first quadrant of the coordinate plane, and interpret coordinate values of points in the context of the situation."
  },
  {
    "sortIndex": "190",
    "category": "Grade 5",
    "subCategory": "Geometry. Classify two-dimensional figures into categories based on their properties.",
    "code": "5.G.3",
    "description": "Understand that attributes belonging to a category of two-dimensional figures also belong to all subcategories of that category. For example, all rectangles have four right angles and squares are rectangles, so all squares have four right angles."
  },
  {
    "sortIndex": "191",
    "category": "Grade 5",
    "subCategory": "Geometry. Classify two-dimensional figures into categories based on their properties.",
    "code": "5.G.4",
    "description": "Classify two-dimensional figures in a hierarchy based on properties."
  },
  {
    "sortIndex": "192",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.1",
    "description": "Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities. For example, “The ratio of wings to beaks in the bird house at the zoo was 2:1, because for every 2 wings there was 1 beak.” “For every vote candidate A received, candidate C received nearly three votes.”"
  },
  {
    "sortIndex": "193",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.2",
    "description": "Understand the concept of a unit rate a/b associated with a ratio a:b with b ≠0, and use rate language in the context of a ratio relationship.  For example, “This recipe has a ratio of 3 cups of flour to 4 cups of sugar, so there is 3/4 cup of flour for each cup of sugar.” “We paid $75 for 15 hamburgers, which is a rate of $5 per hamburger.” (Expectations for unit rates in this grade are limited to non-complex fractions.)"
  },
  {
    "sortIndex": "194",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.3",
    "description": "Use ratio and rate reasoning to solve real-world and mathematical problems, e.g., by reasoning about tables of equivalent ratios, tape diagrams, double number line diagrams, or equations."
  },
  {
    "sortIndex": "195",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.3 a.",
    "description": "Make tables of equivalent ratios relating quantities with whole number measurements, find missing values in the tables, and plot the pairs of values on the coordinate plane. Use tables to compare ratios."
  },
  {
    "sortIndex": "196",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.3 b.",
    "description": "Solve unit rate problems including those involving unit pricing and constant speed.  For example, if it took 7 hours to mow 4 lawns, then at that rate, how many lawns could be mowed in 35 hours? At what rate were lawns being mowed?"
  },
  {
    "sortIndex": "197",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.3 c.",
    "description": "Find a percent of a quantity as a rate per 100 (e.g., 30% of a quantity means 30/100 times the quantity); solve problems involving finding the whole, given a part and the percent."
  },
  {
    "sortIndex": "198",
    "category": "Grade 6",
    "subCategory": "Ratios and Proportional Relationships. Understand ratio concepts and use ratio reasoning to solve problems.",
    "code": "6.RP.3 d.",
    "description": "Use ratio reasoning to convert measurement units; manipulate and transform units appropriately when multiplying or dividing quantities."
  },
  {
    "sortIndex": "199",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of multiplication and division to divide fractions by fractions.",
    "code": "6.NS.1",
    "description": "Interpret and compute quotients of fractions, and solve word problems involving division of fractions by fractions, e.g., by using visual fraction models and equations to represent the problem.  For example, create a story context for (2/3) ÷ (3/4) and use a visual fraction model to show the quotient; use the relationship between multiplication and division to explain that (2/3) ÷ (3/4) = 8/9 because 3/4 of 8/9 is 2/3. (In general, (a/b) ÷ (c/d) = ad/bc.) How much chocolate will each person get if 3 people share 1/2 lb of chocolate equally? How many 3/4-cup servings are in 2/3 of a cup of yogurt? How wide is a rectangular strip of land with length 3/4 mi and area 1/2 square mi?"
  },
  {
    "sortIndex": "200",
    "category": "Grade 6",
    "subCategory": "The Number System. Compute fluently with multi-digit numbers and find common factors and multiples.",
    "code": "6.NS.2",
    "description": "Fluently divide multi-digit numbers using the standard algorithm."
  },
  {
    "sortIndex": "201",
    "category": "Grade 6",
    "subCategory": "The Number System. Compute fluently with multi-digit numbers and find common factors and multiples.",
    "code": "6.NS.3",
    "description": "Fluently add, subtract, multiply, and divide multi-digit decimals using the standard algorithm for each operation."
  },
  {
    "sortIndex": "202",
    "category": "Grade 6",
    "subCategory": "The Number System. Compute fluently with multi-digit numbers and find common factors and multiples.",
    "code": "6.NS.4",
    "description": "Find the greatest common factor of two whole numbers less than or equal to 100 and the least common multiple of two whole numbers less than or equal to 12. Use the distributive property to express a sum of two whole numbers 1–100 with a common factor as a multiple of a sum of two whole numbers with no common factor.  For example, express 36 + 8 as 4 (9 + 2)."
  },
  {
    "sortIndex": "203",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.5",
    "description": "Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above/below zero, elevation above/below sea level, credits/debits, positive/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation."
  },
  {
    "sortIndex": "204",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.6",
    "description": "Understand a rational number as a point on the number line. Extend number line diagrams and coordinate axes familiar from previous grades to represent points on the line and in the plane with negative number coordinates."
  },
  {
    "sortIndex": "205",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.6 a.",
    "description": "Recognize opposite signs of numbers as indicating locations on opposite sides of 0 on the number line; recognize that the opposite of the opposite of a number is the number itself, e.g., –(–3) = 3, and that 0 is its own opposite."
  },
  {
    "sortIndex": "206",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.6 b.",
    "description": "Understand signs of numbers in ordered pairs as indicating locations in quadrants of the coordinate plane; recognize that when two ordered pairs differ only by signs, the locations of the points are related by reflections across one or both axes."
  },
  {
    "sortIndex": "207",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.6 c.",
    "description": "Find and position integers and other rational numbers on a horizontal or vertical number line diagram; find and position pairs of integers and other rational numbers on a coordinate plane."
  },
  {
    "sortIndex": "208",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.7",
    "description": "Understand ordering and absolute value of rational numbers."
  },
  {
    "sortIndex": "209",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.7 a.",
    "description": "Interpret statements of inequality as statements about the relative position of two numbers on a number line diagram.  For example, interpret –3 > –7 as a statement that –3 is located to the right of –7 on a number line oriented from left to right."
  },
  {
    "sortIndex": "210",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.7 b.",
    "description": "Write, interpret, and explain statements of order for rational numbers in real-world contexts. For example, write –3 oC > –7 oC to express the fact that  –3 oC is warmer than –7 oC."
  },
  {
    "sortIndex": "211",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.7 c.",
    "description": "Understand the absolute value of a rational number as its distance from 0 on the number line; interpret absolute value as magnitude for a positive or negative quantity in a real-world situation.  For example, for an account balance of –30 dollars, write |–30| = 30 to describe the size of the debt in dollars"
  },
  {
    "sortIndex": "212",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.7 d.",
    "description": "Distinguish comparisons of absolute value from statements about order.  For example, recognize that an account balance less than –30 dollars represents a debt greater than 30 dollars."
  },
  {
    "sortIndex": "213",
    "category": "Grade 6",
    "subCategory": "The Number System. Apply and extend previous understandings of numbers to the system of rational numbers.",
    "code": "6.NS.8",
    "description": "Solve real-world and mathematical problems by graphing points in all four quadrants of the coordinate plane. Include use of coordinates and absolute value to find distances between points with the same first coordinate or the same second coordinate."
  },
  {
    "sortIndex": "214",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.1",
    "description": "Write and evaluate numerical expressions involving whole-number exponents."
  },
  {
    "sortIndex": "215",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.2",
    "description": "Write, read, and evaluate expressions in which letters stand for numbers."
  },
  {
    "sortIndex": "216",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.2 a.",
    "description": "Write expressions that record operations with numbers and with letters standing for numbers.  For example, express the calculation “Subtract y from 5” as 5 – y."
  },
  {
    "sortIndex": "217",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.2 b.",
    "description": "Identify parts of an expression using mathematical terms (sum, term, product, factor, quotient, coefficient); view one or more parts of an expression as a single entity.  For example, describe the expression 2 (8 + 7) as a product of two factors; view (8 + 7) as both a single entity and a sum of two terms."
  },
  {
    "sortIndex": "218",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.2 c.",
    "description": "Evaluate expressions at specific values of their variables. Include expressions that arise from formulas used in real-world problems. Perform arithmetic operations, including those involving whole number exponents, in the conventional order when there are no parentheses to specify a particular order (Order of Operations). For example, use the formulas V = s3 and A = 6 s2 to find the volume and surface area of a cube with sides of length s = 1/2."
  },
  {
    "sortIndex": "219",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.3",
    "description": "Apply the properties of operations to generate equivalent expressions.  For example, apply the distributive property to the expression 3 (2 + x) to produce the equivalent expression 6 + 3x; apply the distributive property to the expression 24x + 18y to produce the equivalent expression 6 (4x + 3y); apply properties of operations to y + y + y to produce the equivalent expression 3y."
  },
  {
    "sortIndex": "220",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Apply and extend previous understandings of arithmetic to algebraic expressions.",
    "code": "6.EE.4",
    "description": "Identify when two expressions are equivalent (i.e., when the two expressions name the same number regardless of which value is substituted into them).  For example, the expressions y + y + y and 3y are equivalent because they name the same number regardless of which number y stands for."
  },
  {
    "sortIndex": "221",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Reason about and solve one-variable equations and inequalities.",
    "code": "6.EE.5",
    "description": "Understand solving an equation or inequality as a process of answering a question: which values from a specified set, if any, make the equation or inequality true? Use substitution to determine whether a given number in a specified set makes an equation or inequality true."
  },
  {
    "sortIndex": "222",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Reason about and solve one-variable equations and inequalities.",
    "code": "6.EE.6",
    "description": "Use variables to represent numbers and write expressions when solving a real-world or mathematical problem; understand that a variable can represent an unknown number, or, depending on the purpose at hand, any number in a specified set."
  },
  {
    "sortIndex": "223",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Reason about and solve one-variable equations and inequalities.",
    "code": "6.EE.7",
    "description": "Solve real-world and mathematical problems by writing and solving equations of the form x + p = q and px = q for cases in which p, q and x are all nonnegative rational numbers."
  },
  {
    "sortIndex": "224",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Reason about and solve one-variable equations and inequalities.",
    "code": "6.EE.8",
    "description": "Write an inequality of the form x > c or x < c to represent a constraint or condition in a real-world or mathematical problem. Recognize that inequalities of the form x > c or x < c have infinitely many solutions; represent solutions of such inequalities on number line diagrams."
  },
  {
    "sortIndex": "225",
    "category": "Grade 6",
    "subCategory": "Expressions and Equations:. Represent and analyze quantitative relationships between dependent and independent variables.",
    "code": "6.EE.9",
    "description": "Use variables to represent two quantities in a real-world problem that change in relationship to one another; write an equation to express one quantity, thought of as the dependent variable, in terms of the other quantity, thought of as the independent variable. Analyze the relationship between the dependent and independent variables using graphs and tables, and relate these to the equation.  For example, in a problem involving motion at constant speed, list and graph ordered pairs of distances and times, and write the equation d = 65t to represent the relationship between distance and time."
  },
  {
    "sortIndex": "226",
    "category": "Grade 6",
    "subCategory": "Geometry. Solve real-world and mathematical problems involving area, surface area, and volume.",
    "code": "6.G.1",
    "description": "Find the area of right triangles, other triangles, special quadrilaterals, and polygons by composing into rectangles or decomposing into triangles and other shapes; apply these techniques in the context of solving real-world and mathematical problems."
  },
  {
    "sortIndex": "227",
    "category": "Grade 6",
    "subCategory": "Geometry. Solve real-world and mathematical problems involving area, surface area, and volume.",
    "code": "6.G.2",
    "description": "Find the volume of a right rectangular prism with fractional edge lengths by packing it with unit cubes of the appropriate unit fraction edge lengths, and show that the volume is the same as would be found by multiplying the edge lengths of the prism. Apply the formulas V = l w h and V = b h to find volumes of right rectangular prisms with fractional edge lengths in the context of solving real-world and mathematical problems."
  },
  {
    "sortIndex": "228",
    "category": "Grade 6",
    "subCategory": "Geometry. Solve real-world and mathematical problems involving area, surface area, and volume.",
    "code": "6.G.3",
    "description": "Draw polygons in the coordinate plane given coordinates for the vertices; use coordinates to find the length of a side joining points with the same first coordinate or the same second coordinate. Apply these techniques in the context of solving real-world and mathematical problems."
  },
  {
    "sortIndex": "229",
    "category": "Grade 6",
    "subCategory": "Geometry. Solve real-world and mathematical problems involving area, surface area, and volume.",
    "code": "6.G.4",
    "description": "Represent three-dimensional figures using nets made up of rectangles and triangles, and use the nets to find the surface area of these figures. Apply these techniques in the context of solving real-world and mathematical problems."
  },
  {
    "sortIndex": "230",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Develop understanding of statistical variability.",
    "code": "6.SP.1",
    "description": "Recognize a statistical question as one that anticipates variability in the data related to the question and accounts for it in the answers.  For example, “How old am I?” is not a statistical question, but “How old are the students in my school?” is a statistical question because one anticipates variability in students’ ages."
  },
  {
    "sortIndex": "231",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Develop understanding of statistical variability.",
    "code": "6.SP.2",
    "description": "Understand that a set of data collected to answer a statistical question has a distribution which can be described by its center, spread, and overall shape."
  },
  {
    "sortIndex": "232",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Develop understanding of statistical variability.",
    "code": "6.SP.3",
    "description": "Recognize that a measure of center for a numerical data set summarizes all of its values with a single number, while a measure of variation describes how its values vary with a single number."
  },
  {
    "sortIndex": "233",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Summarize and describe distributions.",
    "code": "6.SP.4",
    "description": "Display numerical data in plots on a number line, including dot plots, histograms, and box plots."
  },
  {
    "sortIndex": "234",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Summarize and describe distributions.",
    "code": "6.SP.5",
    "description": "Summarize numerical data sets in relation to their context, such as by:"
  },
  {
    "sortIndex": "235",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Summarize and describe distributions.",
    "code": "6.SP.5 a.",
    "description": "Reporting the number of observations."
  },
  {
    "sortIndex": "236",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Summarize and describe distributions.",
    "code": "6.SP.5 b.",
    "description": "Describing the nature of the attribute under investigation, including how it was measured and its units of measurement."
  },
  {
    "sortIndex": "237",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Summarize and describe distributions.",
    "code": "6.SP.5 c.",
    "description": "Giving quantitative measures of center (median and/or mean) and variability (interquartile range and/or mean absolute deviation), as well as describing any overall pattern and any striking deviations from the overall pattern with reference to the context in which the data were gathered."
  },
  {
    "sortIndex": "238",
    "category": "Grade 6",
    "subCategory": "Statistics and Probability. Summarize and describe distributions.",
    "code": "6.SP.5 d.",
    "description": "Relating the choice of measures of center and variability to the shape of the data distribution and the context in which the data were gathered."
  },
  {
    "sortIndex": "239",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.1",
    "description": "Compute unit rates associated with ratios of fractions, including ratios of lengths, areas and other quantities measured in like or different units.  For example, if a person walks 1/2 mile in each 1/4 hour, compute the unit rate as the complex fraction 1/2/1/4 miles per hour, equivalently 2 miles per hour."
  },
  {
    "sortIndex": "240",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.2",
    "description": "Recognize and represent proportional relationships between quantities."
  },
  {
    "sortIndex": "241",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.2 a.",
    "description": "Decide whether two quantities are in a proportional relationship, e.g., by testing for equivalent ratios in a table or graphing on a coordinate plane and observing whether the graph is a straight line through the origin."
  },
  {
    "sortIndex": "242",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.2 b.",
    "description": "Identify the constant of proportionality (unit rate) in tables, graphs, equations, diagrams, and verbal descriptions of proportional relationships."
  },
  {
    "sortIndex": "243",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.2 c.",
    "description": "Represent proportional relationships by equations.   For example, if total cost t is proportional to the number n of items purchased at a constant price p, the relationship between the total cost and the number of items can be expressed as t = pn."
  },
  {
    "sortIndex": "244",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.2 d.",
    "description": "Explain what a point (x, y) on the graph of a proportional relationship means in terms of the situation, with special attention to the points (0, 0) and (1, r) where r is the unit rate."
  },
  {
    "sortIndex": "245",
    "category": "Grade 7",
    "subCategory": "Ratios and Proportional Relationships. Analyze proportional relationships and use them to solve real-world and mathematical problems.",
    "code": "7.RP.3",
    "description": "Use proportional relationships to solve multistep ratio and percent problems.   Examples: simple interest, tax, markups and markdowns, gratuities and commissions, fees, percent increase and decrease, percent error."
  },
  {
    "sortIndex": "246",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.1",
    "description": "Apply and extend previous understandings of addition and subtraction to add and subtract rational numbers; represent addition and subtraction on a horizontal or vertical number line diagram."
  },
  {
    "sortIndex": "247",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.1 a.",
    "description": "Describe situations in which opposite quantities combine to make 0.  For example, a hydrogen atom has 0 charge because its two constituents are oppositely charged."
  },
  {
    "sortIndex": "248",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.1 b.",
    "description": "Understand p + q as the number located a distance |q| from p, in the positive or negative direction depending on whether q is positive or negative. Show that a number and its opposite have a sum of 0 (are additive inverses). Interpret sums of rational numbers by describing real-world contexts."
  },
  {
    "sortIndex": "249",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.1 c.",
    "description": "Understand subtraction of rational numbers as adding the additive inverse, p – q = p + (–q). Show that the distance between two rational numbers on the number line is the absolute value of their difference, and apply this principle in real-world contexts."
  },
  {
    "sortIndex": "250",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.1 d.",
    "description": "Apply properties of operations as strategies to add and subtract rational numbers."
  },
  {
    "sortIndex": "251",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.2",
    "description": "Apply and extend previous understandings of multiplication and division and of fractions to multiply and divide rational numbers."
  },
  {
    "sortIndex": "252",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.2 a.",
    "description": "Understand that multiplication is extended from fractions to rational numbers by requiring that operations continue to satisfy the properties of operations, particularly the distributive property, leading to products such as (–1)(–1) = 1 and the rules for multiplying signed numbers. Interpret products of rational numbers by describing real-world contexts."
  },
  {
    "sortIndex": "253",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.2 b.",
    "description": "Understand that integers can be divided, provided that the divisor is not zero, and every quotient of integers (with non-zero divisor) is a rational number. If p and q are integers, then –(p/q) = (–p)/q = p/(–q). Interpret quotients of rational numbers by describing real world contexts."
  },
  {
    "sortIndex": "254",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.2 c.",
    "description": "Apply properties of operations as strategies to multiply and divide rational numbers."
  },
  {
    "sortIndex": "255",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.2 d.",
    "description": "Convert a rational number to a decimal using long division; know that the decimal form of a rational number terminates in 0s or eventually repeats."
  },
  {
    "sortIndex": "256",
    "category": "Grade 7",
    "subCategory": "The Number System. Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "code": "7.NS.3",
    "description": "Solve real-world and mathematical problems involving the four operations with rational numbers. (Computations with rational numbers extend the rules for manipulating fractions to complex fractions.)"
  },
  {
    "sortIndex": "257",
    "category": "Grade 7",
    "subCategory": "Expressions and Equations. Use properties of operations to generate equivalent expressions.",
    "code": "7.EE.1",
    "description": "Apply properties of operations as strategies to add, subtract, factor, and expand linear expressions with rational coefficients."
  },
  {
    "sortIndex": "258",
    "category": "Grade 7",
    "subCategory": "Expressions and Equations. Use properties of operations to generate equivalent expressions.",
    "code": "7.EE.2",
    "description": "Understand that rewriting an expression in different forms in a problem context can shed light on the problem and how the quantities in it are related.  For example, a + 0.05a = 1.05a means that “increase by 5%” is the same as “multiply by 1.05.”"
  },
  {
    "sortIndex": "259",
    "category": "Grade 7",
    "subCategory": "Expressions and Equations. Solve real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "code": "7.EE.3",
    "description": "Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form (whole numbers, fractions, and decimals), using tools strategically. Apply properties of operations to calculate with numbers in any form; convert between forms as appropriate; and assess the reasonableness of answers using mental computation and estimation strategies.  For example: If a woman making $25 an hour gets a 10% raise, she will make an additional 1/10 of her salary an hour, or $2.50, for a new salary of $27.50. If you want to place a towel bar 9 3/4 inches long in the center of a door that is 27 1/2 inches wide, you will need to place the bar about 9 inches from each edge; this estimate can be used as a check on the exact computation."
  },
  {
    "sortIndex": "260",
    "category": "Grade 7",
    "subCategory": "Expressions and Equations. Solve real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "code": "7.EE.4",
    "description": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities."
  },
  {
    "sortIndex": "261",
    "category": "Grade 7",
    "subCategory": "Expressions and Equations. Solve real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "code": "7.EE.4 a.",
    "description": "Solve word problems leading to equations of the form px + q = r and p(x + q) = r, where p, q, and r are specific rational numbers. Solve equations of these forms fluently. Compare an algebraic solution to an arithmetic solution, identifying the sequence of the operations used in each approach.  For example, the perimeter of a rectangle is 54 cm. Its length is 6 cm. What is its width?"
  },
  {
    "sortIndex": "262",
    "category": "Grade 7",
    "subCategory": "Expressions and Equations. Solve real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "code": "7.EE.4 b.",
    "description": "Solve word problems leading to inequalities of the form px + q > r or px + q < r, where p, q, and r are specific rational numbers. Graph the solution set of the inequality and interpret it in the context of the problem.  For example: As a salesperson, you are paid $50 per week plus $3 per sale. This week you want your pay to be at least $100. Write an inequality for the number of sales you need to make, and describe the solutions."
  },
  {
    "sortIndex": "263",
    "category": "Grade 7",
    "subCategory": "Geometry. Draw, construct, and describe geometrical figures and describe the relationships between them.",
    "code": "7.G.1",
    "description": "Solve problems involving scale drawings of geometric figures, including computing actual lengths and areas from a scale drawing and reproducing a scale drawing at a different scale."
  },
  {
    "sortIndex": "264",
    "category": "Grade 7",
    "subCategory": "Geometry. Draw, construct, and describe geometrical figures and describe the relationships between them.",
    "code": "7.G.2",
    "description": "Draw (freehand, with ruler and protractor, and with technology) geometric shapes with given conditions. Focus on constructing triangles from three measures of angles or sides, noticing when the conditions determine a unique triangle, more than one triangle, or no triangle."
  },
  {
    "sortIndex": "265",
    "category": "Grade 7",
    "subCategory": "Geometry. Draw, construct, and describe geometrical figures and describe the relationships between them.",
    "code": "7.G.3",
    "description": "Describe the two-dimensional figures that result from slicing three-dimensional figures, as in plane sections of right rectangular prisms and right rectangular pyramids."
  },
  {
    "sortIndex": "266",
    "category": "Grade 7",
    "subCategory": "Geometry. Solve real-life and mathematical problems involving angle measure, area, surface area, and volume.",
    "code": "7.G.4",
    "description": "Know the formulas for the area and circumference of a circle and use them to solve problems; give an informal derivation of the relationship between the circumference and area of a circle."
  },
  {
    "sortIndex": "267",
    "category": "Grade 7",
    "subCategory": "Geometry. Solve real-life and mathematical problems involving angle measure, area, surface area, and volume.",
    "code": "7.G.5",
    "description": "Use facts about supplementary, complementary, vertical, and adjacent angles in a multi-step problem to write and solve simple equations for an unknown angle in a figure."
  },
  {
    "sortIndex": "268",
    "category": "Grade 7",
    "subCategory": "Geometry. Solve real-life and mathematical problems involving angle measure, area, surface area, and volume.",
    "code": "7.G.6",
    "description": "Solve real-world and mathematical problems involving area, volume and surface area of two- and three-dimensional objects composed of triangles, quadrilaterals, polygons, cubes, and right prisms."
  },
  {
    "sortIndex": "269",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Use random sampling to draw inferences about a population.",
    "code": "7.SP.1",
    "description": "Understand that statistics can be used to gain information about a population by examining a sample of the population; generalizations about a population from a sample are valid only if the sample is representative of that population. Understand that random sampling tends to produce representative samples and support valid inferences."
  },
  {
    "sortIndex": "270",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Use random sampling to draw inferences about a population.",
    "code": "7.SP.2",
    "description": "Use data from a random sample to draw inferences about a population with an unknown characteristic of interest. Generate multiple samples (or simulated samples) of the same size to gauge the variation in estimates or predictions.  For example, estimate the mean word length in a book by randomly sampling words from the book; predict the winner of a school election based on randomly sampled survey data. Gauge how far off the estimate or prediction might be."
  },
  {
    "sortIndex": "271",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Draw informal comparative inferences about two populations.",
    "code": "7.SP.3",
    "description": "Informally assess the degree of visual overlap of two numerical data distributions with similar variabilities, measuring the difference between the centers by expressing it as a multiple of a measure of variability. For example, the mean height of players on the basketball team is 10 cm greater than the mean height of players on the soccer team, about twice the variability (mean absolute deviation) on either team; on a dot plot, the separation between the two distributions of heights is noticeable."
  },
  {
    "sortIndex": "272",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Draw informal comparative inferences about two populations.",
    "code": "7.SP.4",
    "description": "Use measures of center and measures of variability for numerical data from random samples to draw informal comparative inferences about two populations. For example, decide whether the words in a chapter of a seventh-grade science book are generally longer than the words in a chapter of a fourth-grade science book."
  },
  {
    "sortIndex": "273",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.5",
    "description": "Understand that the probability of a chance event is a number between 0 and 1 that expresses the likelihood of the event occurring. Larger numbers indicate greater likelihood. A probability near 0 indicates an unlikely event, a probability around 1/2 indicates an event that is neither unlikely nor likely, and a probability near 1 indicates a likely event."
  },
  {
    "sortIndex": "274",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.6",
    "description": "Approximate the probability of a chance event by collecting data on the chance process that produces it and observing its long-run relative frequency, and predict the approximate relative frequency given the probability.  For example, when rolling a number cube 600 times, predict that a 3 or 6 would be rolled roughly 200 times, but probably not exactly 200 times."
  },
  {
    "sortIndex": "275",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.7",
    "description": "Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy."
  },
  {
    "sortIndex": "276",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.7 a.",
    "description": "Develop a uniform probability model by assigning equal probability to all outcomes, and use the model to determine probabilities of events.  For example, if a student is selected at random from a class, find the probability that Jane will be selected and the probability that a girl will be selected."
  },
  {
    "sortIndex": "277",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.7 b.",
    "description": "Develop a probability model (which may not be uniform) by observing frequencies in data generated from a chance process.  For example, find the approximate probability that a spinning penny will land heads up or that a tossed paper cup will land open-end down. Do the outcomes for the spinning penny appear to be equally likely based on the observed frequencies?"
  },
  {
    "sortIndex": "278",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.8",
    "description": "Find probabilities of compound events using organized lists, tables, tree diagrams, and simulation."
  },
  {
    "sortIndex": "279",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.8 a.",
    "description": "Understand that, just as with simple events, the probability of a compound event is the fraction of outcomes in the sample space for which the compound event occurs."
  },
  {
    "sortIndex": "280",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.8 b.",
    "description": "Represent sample spaces for compound events using methods such as organized lists, tables and tree diagrams. For an event described in everyday language (e.g., “rolling double sixes”), identify the outcomes in the sample space which compose the event."
  },
  {
    "sortIndex": "281",
    "category": "Grade 7",
    "subCategory": "Statistics and Probability. Investigate chance processes and develop, use, and evaluate probability models.",
    "code": "7.SP.8 c.",
    "description": "Design and use a simulation to generate frequencies for compound events.  . For example, use random digits as a simulation tool to approximate the answer to the question: If 40% of donors have type A blood, what is the probability that it will take at least 4 donors to find one with type A blood?"
  },
  {
    "sortIndex": "282",
    "category": "Grade 8",
    "subCategory": "The Number System. Know that there are numbers that are not rational, and approximate them by rational numbers.",
    "code": "8.NS.1",
    "description": "Know that numbers that are not rational are called irrational. Understand informally that every number has a decimal expansion; for rational numbers show that the decimal expansion repeats eventually, and convert a decimal expansion which repeats eventually into a rational number."
  },
  {
    "sortIndex": "283",
    "category": "Grade 8",
    "subCategory": "The Number System. Know that there are numbers that are not rational, and approximate them by rational numbers.",
    "code": "8.NS.2",
    "description": "Use rational approximations of irrational numbers to compare the size of irrational numbers, locate them approximately on a number line diagram, and estimate the value of expressions (e.g., p2). For example, by truncating the decimal expansion of Ö2, show that Ö2 is between 1 and 2, then between 1.4 and 1.5, and explain how to continue on to get better approximations."
  },
  {
    "sortIndex": "284",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Work with radicals and integer exponents.",
    "code": "8.EE.1",
    "description": "Know and apply the properties of integer exponents to generate equivalent numerical expressions.  For example, 32 × 3–5 = 3–3 = 1/33 = 1/27."
  },
  {
    "sortIndex": "285",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Work with radicals and integer exponents.",
    "code": "8.EE.2",
    "description": "Use square root and cube root symbols to represent solutions to equations of the form x2 = p and x3 = p, where p is a positive rational number. Evaluate square roots of small perfect squares and cube roots of small perfect cubes. Know that Ö2 is irrational."
  },
  {
    "sortIndex": "286",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Work with radicals and integer exponents.",
    "code": "8.EE.3",
    "description": "Use numbers expressed in the form of a single digit times an integer power of 10 to estimate very large or very small quantities, and to express how many times as much one is than the other.  For example, estimate the population of the United States as 3 × 108 and the population of the world as 7 × 109, and determine that the world population is more than 20 times larger."
  },
  {
    "sortIndex": "287",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Work with radicals and integer exponents.",
    "code": "8.EE.4",
    "description": "Perform operations with numbers expressed in scientific notation, including problems where both decimal and scientific notation are used. Use scientific notation and choose units of appropriate size for measurements of very large or very small quantities (e.g., use millimeters per year for seafloor spreading). Interpret scientific notation that has been generated by technology."
  },
  {
    "sortIndex": "288",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Understand the connections between proportional relationships, lines, and linear equations.",
    "code": "8.EE.5",
    "description": "Graph proportional relationships, interpreting the unit rate as the slope of the graph. Compare two different proportional relationships represented in different ways.  For example, compare a distance-time graph to a distance-time equation to determine which of two moving objects has greater speed."
  },
  {
    "sortIndex": "289",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Understand the connections between proportional relationships, lines, and linear equations.",
    "code": "8.EE.6",
    "description": "Use similar triangles to explain why the slope m is the same between any two distinct points on a non-vertical line in the coordinate plane; derive the equation y = mx for a line through the origin and the equation y = mx + b for a line intercepting the vertical axis at b."
  },
  {
    "sortIndex": "290",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.7",
    "description": "Solve linear equations in one variable."
  },
  {
    "sortIndex": "291",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.7 a.",
    "description": "Give examples of linear equations in one variable with one solution, infinitely many solutions, or no solutions. Show which of these possibilities is the case by successively transforming the given equation into simpler forms, until an equivalent equation of the form x = a, a = a, or a = b results (where a and b are different numbers)."
  },
  {
    "sortIndex": "292",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.7 b.",
    "description": "Solve linear equations with rational number coefficients, including equations whose solutions require expanding expressions using the distributive property and collecting like terms."
  },
  {
    "sortIndex": "293",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.8",
    "description": "Analyze and solve pairs of simultaneous linear equations."
  },
  {
    "sortIndex": "294",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.8 a.",
    "description": "Understand that solutions to a system of two linear equations in two variables correspond to points of intersection of their graphs, because points of intersection satisfy both equations simultaneously."
  },
  {
    "sortIndex": "295",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.8 b.",
    "description": "Solve systems of two linear equations in two variables algebraically, and estimate solutions by graphing the equations. Solve simple cases by inspection.  For example, 3x + 2y = 5 and 3x + 2y = 6 have no solution because 3x + 2y cannot simultaneously be 5 and 6."
  },
  {
    "sortIndex": "296",
    "category": "Grade 8",
    "subCategory": "Expressions and Equations. Analyze and solve linear equations and pairs of simultaneous linear equations.",
    "code": "8.EE.8 c.",
    "description": "Solve real-world and mathematical problems leading to two linear equations in two variables. For example, given coordinates for two pairs of points, determine whether the line through the first pair of points intersects the line through the second pair."
  },
  {
    "sortIndex": "297",
    "category": "Grade 8",
    "subCategory": "Functions. Define, evaluate, and compare functions.",
    "code": "8.F.1",
    "description": "Understand that a function is a rule that assigns to each input exactly one output. The graph of a function is the set of ordered pairs consisting of an input and the corresponding output. (Function notation is not required in Grade 8.)"
  },
  {
    "sortIndex": "298",
    "category": "Grade 8",
    "subCategory": "Functions. Define, evaluate, and compare functions.",
    "code": "8.F.2",
    "description": "Compare properties of two functions each represented in a different way (algebraically, graphically, numerically in tables, or by verbal descriptions).  For example, given a linear function represented by a table of values and a linear function represented by an algebraic expression, determine which function has the greater rate of change."
  },
  {
    "sortIndex": "299",
    "category": "Grade 8",
    "subCategory": "Functions. Define, evaluate, and compare functions.",
    "code": "8.F.3",
    "description": "Interpret the equation y = mx + b as defining a linear function, whose graph is a straight line; give examples of functions that are not linear.  For example, the function A = s2 giving the area of a square as a function of its side length is not linear because its graph contains the points (1,1), (2,4) and (3,9), which are not on a straight line."
  },
  {
    "sortIndex": "300",
    "category": "Grade 8",
    "subCategory": "Functions. Use functions to model relationships between quantities.",
    "code": "8.F.4",
    "description": "Construct a function to model a linear relationship between two quantities. Determine the rate of change and initial value of the function from a description of a relationship or from two (x, y) values, including reading these from a table or from a graph. Interpret the rate of change and initial value of a linear function in terms of the situation it models, and in terms of its graph or a table of values."
  },
  {
    "sortIndex": "301",
    "category": "Grade 8",
    "subCategory": "Functions. Use functions to model relationships between quantities.",
    "code": "8.F.5",
    "description": "Describe qualitatively the functional relationship between two quantities by analyzing a graph (e.g., where the function is increasing or decreasing, linear or nonlinear). Sketch a graph that exhibits the qualitative features of a function that has been described verbally."
  },
  {
    "sortIndex": "302",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.1",
    "description": "Verify experimentally the properties of rotations, reflections, and translations:"
  },
  {
    "sortIndex": "303",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.1 a.",
    "description": "Lines are taken to lines, and line segments to line segments of the same length."
  },
  {
    "sortIndex": "304",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.1 b.",
    "description": "Angles are taken to angles of the same measure."
  },
  {
    "sortIndex": "305",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.1 c.",
    "description": "Parallel lines are taken to parallel lines."
  },
  {
    "sortIndex": "306",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.2",
    "description": "Understand that a two-dimensional figure is congruent to another if the second can be obtained from the first by a sequence of rotations, reflections, and translations; given two congruent figures, describe a sequence that exhibits the congruence between them."
  },
  {
    "sortIndex": "307",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.3",
    "description": "Describe the effect of dilations, translations, rotations, and reflections on two-dimensional figures using coordinates."
  },
  {
    "sortIndex": "308",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.4",
    "description": "Understand that a two-dimensional figure is similar to another if the second can be obtained from the first by a sequence of rotations, reflections, translations, and dilations; given two similar two-dimensional figures, describe a sequence that exhibits the similarity between them."
  },
  {
    "sortIndex": "309",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand congruence and similarity using physical models, transparencies, or geometry software.",
    "code": "8.G.5",
    "description": "Use informal arguments to establish facts about the angle sum and exterior angle of triangles, about the angles created when parallel lines are cut by a transversal, and the angle-angle criterion for similarity of triangles. For example, arrange three copies of the same triangle so that the sum of the three angles appears to form a line, and give an argument in terms of transversals why this is so."
  },
  {
    "sortIndex": "310",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand and apply the Pythagorean Theorem.",
    "code": "8.G.6",
    "description": "Explain a proof of the Pythagorean Theorem and its converse."
  },
  {
    "sortIndex": "311",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand and apply the Pythagorean Theorem.",
    "code": "8.G.7",
    "description": "Apply the Pythagorean Theorem to determine unknown side lengths in right triangles in real-world and mathematical problems in two and three dimensions."
  },
  {
    "sortIndex": "312",
    "category": "Grade 8",
    "subCategory": "Geometry. Understand and apply the Pythagorean Theorem.",
    "code": "8.G.8",
    "description": "Apply the Pythagorean Theorem to find the distance between two points in a coordinate system."
  },
  {
    "sortIndex": "313",
    "category": "Grade 8",
    "subCategory": "Geometry. Solve real-world and mathematical problems involving volume of cylinders, cones, and spheres.",
    "code": "8.G.9",
    "description": "Know the formulas for the volumes of cones, cylinders, and spheres and use them to solve real-world and mathematical problems."
  },
  {
    "sortIndex": "314",
    "category": "Grade 8",
    "subCategory": "Statistics and Probability. Investigate patterns of association in bivariate data.",
    "code": "8.SP.1",
    "description": "Construct and interpret scatter plots for bivariate measurement data to investigate patterns of association between two quantities. Describe patterns such as clustering, outliers, positive or negative association, linear association, and nonlinear association."
  },
  {
    "sortIndex": "315",
    "category": "Grade 8",
    "subCategory": "Statistics and Probability. Investigate patterns of association in bivariate data.",
    "code": "8.SP.2",
    "description": "Know that straight lines are widely used to model relationships between two quantitative variables. For scatter plots that suggest a linear association, informally fit a straight line, and informally assess the model fit by judging the closeness of the data points to the line."
  },
  {
    "sortIndex": "316",
    "category": "Grade 8",
    "subCategory": "Statistics and Probability. Investigate patterns of association in bivariate data.",
    "code": "8.SP.3",
    "description": "Use the equation of a linear model to solve problems in the context of bivariate measurement data, interpreting the slope and intercept.  For example, in a linear model for a biology experiment, interpret a slope of 1.5 cm/hr as meaning that an additional hour of sunlight each day is associated with an additional 1.5 cm in mature plant height."
  },
  {
    "sortIndex": "317",
    "category": "Grade 8",
    "subCategory": "Statistics and Probability. Investigate patterns of association in bivariate data.",
    "code": "8.SP.4",
    "description": "Understand that patterns of association can also be seen in bivariate categorical data by displaying frequencies and relative frequencies in a two-way table. Construct and interpret a two-way table summarizing data on two categorical variables collected from the same subjects. Use relative frequencies calculated for rows or columns to describe possible association between the two variables.  For example, collect data from students in your class on whether or not they have a curfew on school nights and whether or not they have assigned chores at home. Is there evidence that those who have a curfew also tend to have chores?"
  },
  {
    "sortIndex": "318",
    "category": "HS",
    "subCategory": "The Real Number System. Extend the properties of exponents to rational exponents.",
    "code": "N.RN.1",
    "description": "Explain how the definition of the meaning of rational exponents follows from extending the properties of integer exponents to those values, allowing for a notation for radicals in terms of rational exponents.  For example, we define 51/3 to be the cube root of 5 because we want (51/3)3 = 5(1/3)3 to hold, so (51/3)3 must equal 5."
  },
  {
    "sortIndex": "319",
    "category": "HS",
    "subCategory": "The Real Number System. Extend the properties of exponents to rational exponents.",
    "code": "N.RN.2",
    "description": "Rewrite expressions involving radicals and rational exponents using the properties of exponents."
  },
  {
    "sortIndex": "320",
    "category": "HS",
    "subCategory": "The Real Number System. Use properties of rational and irrational numbers.",
    "code": "N.RN.3",
    "description": "Explain why the sum or product of two rational numbers is rational; that the sum of a rational number and an irrational number is irrational; and that the product of a nonzero rational number and an irrational number is irrational."
  },
  {
    "sortIndex": "321",
    "category": "HS",
    "subCategory": "Quantities*. Reason quantitatively and use units to solve problems.",
    "code": "N.Q.1",
    "description": "Use units as a way to understand problems and to guide the solution of multi-step problems; choose and interpret units consistently in formulas; choose and interpret the scale and the origin in graphs and data displays."
  },
  {
    "sortIndex": "322",
    "category": "HS",
    "subCategory": "Quantities*. Reason quantitatively and use units to solve problems.",
    "code": "N.Q.2",
    "description": "Define appropriate quantities for the purpose of descriptive modeling."
  },
  {
    "sortIndex": "323",
    "category": "HS",
    "subCategory": "Quantities*. Reason quantitatively and use units to solve problems.",
    "code": "N.Q.3",
    "description": "Choose a level of accuracy appropriate to limitations on measurement when reporting quantities."
  },
  {
    "sortIndex": "324",
    "category": "HS",
    "subCategory": "The Complex Number System. Perform arithmetic operations with complex numbers.",
    "code": "N.CN.1",
    "description": "Know there is a complex number i such that i2 = –1, and every complex number has the form a + bi with a and b real."
  },
  {
    "sortIndex": "325",
    "category": "HS",
    "subCategory": "The Complex Number System. Perform arithmetic operations with complex numbers.",
    "code": "N.CN.2",
    "description": "Use the relation i2 = –1 and the commutative, associative, and distributive properties to add, subtract, and multiply complex numbers."
  },
  {
    "sortIndex": "326",
    "category": "HS",
    "subCategory": "The Complex Number System. Perform arithmetic operations with complex numbers.",
    "code": "N.CN.3",
    "description": "(+) Find the conjugate of a complex number; use conjugates to find moduli and quotients of complex numbers."
  },
  {
    "sortIndex": "327",
    "category": "HS",
    "subCategory": "The Complex Number System. Represent complex numbers and their operations on the complex plane.",
    "code": "N.CN.4",
    "description": "(+) Represent complex numbers on the complex plane in rectangular and polar form (including real and imaginary numbers), and explain why the rectangular and polar forms of a given complex number represent the same number."
  },
  {
    "sortIndex": "328",
    "category": "HS",
    "subCategory": "The Complex Number System. Represent complex numbers and their operations on the complex plane.",
    "code": "N.CN.5",
    "description": "(+) Represent addition, subtraction, multiplication, and conjugation of complex numbers geometrically on the complex plane; use properties of this representation for computation.  For example, (-1 + Ö3i)3 = 8 because (-1 + Ö3i) has modulus 2 and argument 120°."
  },
  {
    "sortIndex": "329",
    "category": "HS",
    "subCategory": "The Complex Number System. Represent complex numbers and their operations on the complex plane.",
    "code": "N.CN.6",
    "description": "(+) Calculate the distance between numbers in the complex plane as the modulus of the difference, and the midpoint of a segment as the average of the numbers at its endpoints."
  },
  {
    "sortIndex": "330",
    "category": "HS",
    "subCategory": "The Complex Number System. Use complex numbers in polynomial identities and equations.",
    "code": "N.CN.7",
    "description": "Solve quadratic equations with real coefficients that have complex solutions."
  },
  {
    "sortIndex": "331",
    "category": "HS",
    "subCategory": "The Complex Number System. Use complex numbers in polynomial identities and equations.",
    "code": "N.CN.8",
    "description": "(+) Extend polynomial identities to the complex numbers.  For example, rewrite x2 + 4 as (x + 2i)(x – 2i)."
  },
  {
    "sortIndex": "332",
    "category": "HS",
    "subCategory": "The Complex Number System. Use complex numbers in polynomial identities and equations.",
    "code": "N.CN.9",
    "description": "(+) Know the Fundamental Theorem of Algebra; show that it is true for quadratic polynomials."
  },
  {
    "sortIndex": "333",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Represent and model with vector quantities.",
    "code": "N.VM.1",
    "description": "(+) Recognize vector quantities as having both magnitude and direction. Represent vector quantities by directed line segments, and use appropriate symbols for vectors and their magnitudes (e.g., v, |v|, ||v||, v)."
  },
  {
    "sortIndex": "334",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Represent and model with vector quantities.",
    "code": "N.VM.2",
    "description": "(+) Find the components of a vector by subtracting the coordinates of an initial point from the coordinates of a terminal point."
  },
  {
    "sortIndex": "335",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Represent and model with vector quantities.",
    "code": "N.VM.3",
    "description": "(+) Solve problems involving velocity and other quantities that can be represented by vectors."
  },
  {
    "sortIndex": "336",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.4",
    "description": "(+) Add and subtract vectors."
  },
  {
    "sortIndex": "337",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.4 a.",
    "description": "Add vectors end-to-end, component-wise, and by the parallelogram rule. Understand that the magnitude of a sum of two vectors is typically not the sum of the magnitudes."
  },
  {
    "sortIndex": "338",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.4 b.",
    "description": "Given two vectors in magnitude and direction form, determine the magnitude and direction of their sum."
  },
  {
    "sortIndex": "339",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.4 c.",
    "description": "Understand vector subtraction v – w as v + (–w), where –w is the additive inverse of w, with the same magnitude as w and pointing in the opposite direction. Represent vector subtraction graphically by connecting the tips in the appropriate order, and perform vector subtraction component-wise."
  },
  {
    "sortIndex": "340",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.5",
    "description": "(+) Multiply a vector by a scalar."
  },
  {
    "sortIndex": "341",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.5 a.",
    "description": "Represent scalar multiplication graphically by scaling vectors and possibly reversing their direction; perform scalar multiplication component-wise, e.g., as c(vx, vy) = (cvx, cvy)."
  },
  {
    "sortIndex": "342",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on vectors.",
    "code": "N.VM.5 b.",
    "description": "Compute the magnitude of a scalar multiple cv using ||cv|| = |c|v. Compute the direction of cv knowing that when |c|v ≠0, the direction of cv is either along v (for c > 0) or against v (for c < 0)."
  },
  {
    "sortIndex": "343",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.6",
    "description": "(+) Use matrices to represent and manipulate data, e.g., to represent payoffs or incidence relationships in a network."
  },
  {
    "sortIndex": "344",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.7",
    "description": "(+) Multiply matrices by scalars to produce new matrices, e.g., as when all of the payoffs in a game are doubled."
  },
  {
    "sortIndex": "345",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.8",
    "description": "(+) Add, subtract, and multiply matrices of appropriate dimensions."
  },
  {
    "sortIndex": "346",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.9",
    "description": "(+) Understand that, unlike multiplication of numbers, matrix multiplication for square matrices is not a commutative operation, but still satisfies the associative and distributive properties."
  },
  {
    "sortIndex": "347",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.10",
    "description": "(+) Understand that the zero and identity matrices play a role in matrix addition and multiplication similar to the role of 0 and 1 in the real numbers. The determinant of a square matrix is nonzero if and only if the matrix has a multiplicative inverse."
  },
  {
    "sortIndex": "348",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.11",
    "description": "(+) Multiply a vector (regarded as a matrix with one column) by a matrix of suitable dimensions to produce another vector. Work with matrices as transformations of vectors."
  },
  {
    "sortIndex": "349",
    "category": "HS",
    "subCategory": "Vector and Matrix Quantities. Perform operations on matrices and use matrices in applications.",
    "code": "N.VM.12",
    "description": "(+) Work with 2 × 2 matrices as a transformations of the plane, and interpret the absolute value of the determinant in terms of area."
  },
  {
    "sortIndex": "350",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Interpret the structure of expressions.",
    "code": "A.SSE.1",
    "description": "Interpret expressions that represent a quantity in terms of its context.★"
  },
  {
    "sortIndex": "351",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Interpret the structure of expressions.",
    "code": "A.SSE.1 a.",
    "description": "Interpret parts of an expression, such as terms, factors, and coefficients."
  },
  {
    "sortIndex": "352",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Interpret the structure of expressions.",
    "code": "A.SSE.1 b.",
    "description": "Interpret complicated expressions by viewing one or more of their parts as a single entity.  For example, interpret P(1+r)n as the product of P and a factor not depending on P."
  },
  {
    "sortIndex": "353",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Interpret the structure of expressions.",
    "code": "A.SSE.2",
    "description": "Use the structure of an expression to identify ways to rewrite it.  For example, see x4 – y4 as (x2)2 – (y2)2, thus recognizing it as a difference of squares that can be factored as (x2 – y2)(x2 + y2)."
  },
  {
    "sortIndex": "354",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Write expressions in equivalent forms to solve problems.",
    "code": "A.SSE.3",
    "description": "Choose and produce an equivalent form of an expression to reveal and explain properties of the quantity represented by the expression. ★"
  },
  {
    "sortIndex": "355",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Write expressions in equivalent forms to solve problems.",
    "code": "A.SSE.3 a.",
    "description": "Factor a quadratic expression to reveal the zeros of the function it defines."
  },
  {
    "sortIndex": "356",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Write expressions in equivalent forms to solve problems.",
    "code": "A.SSE.3 b.",
    "description": "Complete the square in a quadratic expression to reveal the maximum or minimum value of the function it defines."
  },
  {
    "sortIndex": "357",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Write expressions in equivalent forms to solve problems.",
    "code": "A.SSE.3 c.",
    "description": "Use the properties of exponents to transform expressions for exponential functions.  For example the expression 1.15t can be rewritten as (1.151/12)12t ≈1.01212t to reveal the approximate equivalent monthly interest rate if the annual rate is 15%."
  },
  {
    "sortIndex": "358",
    "category": "HS",
    "subCategory": "Seeing Structure in Expressions. Write expressions in equivalent forms to solve problems.",
    "code": "A.SSE.4",
    "description": "Derive the formula for the sum of a finite geometric series (when the common ratio is not 1), and use the formula to solve problems.  For example, calculate mortgage payments.★"
  },
  {
    "sortIndex": "359",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Perform arithmetic operations on polynomials.",
    "code": "A.APR.1",
    "description": "Understand that polynomials form a system analogous to the integers, namely, they are closed under the operations of addition, subtraction, and multiplication; add, subtract, and multiply polynomials."
  },
  {
    "sortIndex": "360",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Understand the relationship between zeros and factors of polynomials.",
    "code": "A.APR.2",
    "description": "Know and apply the Remainder Theorem: For a polynomial p(x) and a number a, the remainder on division by x – a is p(a), so p(a) = 0 if and only if (x – a) is a factor of p(x)."
  },
  {
    "sortIndex": "361",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Understand the relationship between zeros and factors of polynomials.",
    "code": "A.APR.3",
    "description": "Identify zeros of polynomials when suitable factorizations are available, and use the zeros to construct a rough graph of the function defined by the polynomial."
  },
  {
    "sortIndex": "362",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Use polynomial identities to solve problems.",
    "code": "A.APR.4",
    "description": "Prove polynomial identities and use them to describe numerical relationships.  For example, the polynomial identity (x2 + y2)2 = (x2 – y2)2 + (2xy)2 can be used to generate Pythagorean triples."
  },
  {
    "sortIndex": "363",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Use polynomial identities to solve problems.",
    "code": "A.APR.5",
    "description": "(+) Know and apply the Binomial Theorem for the expansion of (x + y)n in powers of x and y for a positive integer n, where x and y are any numbers, with coefficients determined for example by Pascal’s Triangle.  (The Binomial Theorem can be proved by mathematical induction or by a combinatorial argument.)"
  },
  {
    "sortIndex": "364",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Rewrite rational expressions.",
    "code": "A.APR.6",
    "description": "Rewrite simple rational expressions in different forms; write a(x)/b(x) in the form q(x) + r(x)/b(x), where a(x), b(x), q(x), and r(x) are polynomials with the degree of r(x) less than the degree of b(x), using inspection, long division, or, for the more complicated examples, a computer algebra system."
  },
  {
    "sortIndex": "365",
    "category": "HS",
    "subCategory": "Arithmetic with Polynomials and Rational Expressions. Rewrite rational expressions.",
    "code": "A.APR.7",
    "description": "(+) Understand that rational expressions form a system analogous to the rational numbers, closed under addition, subtraction, multiplication, and division by a nonzero rational expression; add, subtract, multiply, and divide rational expressions."
  },
  {
    "sortIndex": "366",
    "category": "HS",
    "subCategory": "Creating Equations*. Create equations that describe numbers or relationships",
    "code": "A.CED.1",
    "description": "Create equations and inequalities in one variable and use them to solve problems. Include equations arising from linear and quadratic functions, and simple rational and exponential functions."
  },
  {
    "sortIndex": "367",
    "category": "HS",
    "subCategory": "Creating Equations*. Create equations that describe numbers or relationships",
    "code": "A.CED.2",
    "description": "Create equations in two or more variables to represent relationships between quantities; graph equations on coordinate axes with labels and scales."
  },
  {
    "sortIndex": "368",
    "category": "HS",
    "subCategory": "Creating Equations*. Create equations that describe numbers or relationships",
    "code": "A.CED.3",
    "description": "Represent constraints by equations or inequalities, and by systems of equations and/or inequalities, and interpret solutions as viable or nonviable options in a modeling context.  For example, represent inequalities describing nutritional and cost constraints on combinations of different foods."
  },
  {
    "sortIndex": "369",
    "category": "HS",
    "subCategory": "Creating Equations*. Create equations that describe numbers or relationships",
    "code": "A.CED.4",
    "description": "Rearrange formulas to highlight a quantity of interest, using the same reasoning as in solving equations. For example, rearrange Ohm’s law V = IR to highlight resistance R."
  },
  {
    "sortIndex": "370",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Understand solving equations as a process of reasoning and explain the reasoning.",
    "code": "A.REI.1",
    "description": "Explain each step in solving a simple equation as following from the equality of numbers asserted at the previous step, starting from the assumption that the original equation has a solution. Construct a viable argument to justify a solution method."
  },
  {
    "sortIndex": "371",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Understand solving equations as a process of reasoning and explain the reasoning.",
    "code": "A.REI.2",
    "description": "Solve simple rational and radical equations in one variable, and give examples showing how extraneous solutions may arise."
  },
  {
    "sortIndex": "372",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve equations and inequalities in one variable.",
    "code": "A.REI.3",
    "description": "Solve linear equations and inequalities in one variable, including equations with coefficients represented by letters."
  },
  {
    "sortIndex": "373",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve equations and inequalities in one variable.",
    "code": "A.REI.4",
    "description": "Solve quadratic equations in one variable."
  },
  {
    "sortIndex": "374",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve equations and inequalities in one variable.",
    "code": "A.REI.4 a.",
    "description": "Use the method of completing the square to transform any quadratic equation in x into an equation of the form (x – p)2 = q that has the same solutions. Derive the quadratic formula from this form."
  },
  {
    "sortIndex": "375",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve equations and inequalities in one variable.",
    "code": "A.REI.4 b.",
    "description": "Solve quadratic equations by inspection (e.g., for x2 = 49), taking square roots, completing the square, the quadratic formula and factoring, as appropriate to the initial form of the equation. Recognize when the quadratic formula gives complex solutions and write them as a ± bi for real numbers a and b."
  },
  {
    "sortIndex": "376",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve systems of equations.",
    "code": "A.REI.5",
    "description": "Prove that, given a system of two equations in two variables, replacing one equation by the sum of that equation and a multiple of the other produces a system with the same solutions."
  },
  {
    "sortIndex": "377",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve systems of equations.",
    "code": "A.REI.6",
    "description": "Solve systems of linear equations exactly and approximately (e.g., with graphs), focusing on pairs of linear equations in two variables."
  },
  {
    "sortIndex": "378",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve systems of equations.",
    "code": "A.REI.7",
    "description": "Solve a simple system consisting of a linear equation and a quadratic equation in two variables algebraically and graphically.  For example, find the points of intersection between the line y = –3x and the circle x2 + y2 = 3."
  },
  {
    "sortIndex": "379",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve systems of equations.",
    "code": "A.REI.8",
    "description": "(+) Represent a system of linear equations as a single matrix equation in a vector variable."
  },
  {
    "sortIndex": "380",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Solve systems of equations.",
    "code": "A.REI.9",
    "description": "(+) Find the inverse of a matrix if it exists and use it to solve systems of linear equations (using technology for matrices of dimension 3 × 3 or greater)."
  },
  {
    "sortIndex": "381",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Represent and solve equations and inequalities graphically.",
    "code": "A.REI.10",
    "description": "Understand that the graph of an equation in two variables is the set of all its solutions plotted in the coordinate plane, often forming a curve (which could be a line)."
  },
  {
    "sortIndex": "382",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Represent and solve equations and inequalities graphically.",
    "code": "A.REI.11",
    "description": "Explain why the x-coordinates of the points where the graphs of the equations y = f(x) and y = g(x) intersect are the solutions of the equation f(x) = g(x); find the solutions approximately, e.g., using technology to graph the functions, make tables of values, or find successive approximations. Include cases where f(x) and/or g(x) are linear, polynomial, rational, absolute value, exponential, and logarithmic functions.★"
  },
  {
    "sortIndex": "383",
    "category": "HS",
    "subCategory": "Reasoning with Equations and Inequalities. Represent and solve equations and inequalities graphically.",
    "code": "A.REI.12",
    "description": "Graph the solutions to a linear inequality in two variables as a half plane (excluding the boundary in the case of a strict inequality), and graph the solution set to a system of linear inequalities in two variables as the intersection of the corresponding half-planes."
  },
  {
    "sortIndex": "384",
    "category": "HS",
    "subCategory": "Interpreting Functions. Understand the concept of a function and use function notation.",
    "code": "F.IF.1",
    "description": "Understand that a function from one set (called the domain) to another set (called the range) assigns to each element of the domain exactly one element of the range. If f is a function and x is an element of its domain, then f(x) denotes the output of f corresponding to the input x. The graph of f is the graph of the equation y = f(x)."
  },
  {
    "sortIndex": "385",
    "category": "HS",
    "subCategory": "Interpreting Functions. Understand the concept of a function and use function notation.",
    "code": "F.IF.2",
    "description": "Use function notation, evaluate functions for inputs in their domains, and interpret statements that use function notation in terms of a context."
  },
  {
    "sortIndex": "386",
    "category": "HS",
    "subCategory": "Interpreting Functions. Understand the concept of a function and use function notation.",
    "code": "F.IF.3",
    "description": "Recognize that sequences are functions, sometimes defined recursively, whose domain is a subset of the integers.  For example, the Fibonacci sequence is defined recursively by f(0) = f(1) = 1, f(n+1) = f(n) + f(n-1) for n ³ 1."
  },
  {
    "sortIndex": "387",
    "category": "HS",
    "subCategory": "Interpreting Functions. Interpret functions that arise in applications in terms of the context.",
    "code": "F.IF.4",
    "description": "For a function that models a relationship between two quantities, interpret key features of graphs and tables in terms of the quantities, and sketch graphs showing key features given a verbal description of the relationship. Key features include: intercepts; intervals where the function is increasing, decreasing, positive, or negative; relative maximums and minimums; symmetries; end behavior; and periodicity.★"
  },
  {
    "sortIndex": "388",
    "category": "HS",
    "subCategory": "Interpreting Functions. Interpret functions that arise in applications in terms of the context.",
    "code": "F.IF.5",
    "description": "Relate the domain of a function to its graph and, where applicable, to the quantitative relationship it describes.   For example, if the function h(n) gives the number of person-hours it takes to assemble n engines in a factory, then the positive integers would be an appropriate domain for the function.★"
  },
  {
    "sortIndex": "389",
    "category": "HS",
    "subCategory": "Interpreting Functions. Interpret functions that arise in applications in terms of the context.",
    "code": "F.IF.6",
    "description": "Calculate and interpret the average rate of change of a function (presented symbolically or as a table) over a specified interval. Estimate the rate of change from a graph.★"
  },
  {
    "sortIndex": "390",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.7",
    "description": "Graph functions expressed symbolically and show key features of the graph, by hand in simple cases and using technology for more complicated cases.★"
  },
  {
    "sortIndex": "391",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.7 a.",
    "description": "Graph linear and quadratic functions and show intercepts, maxima, and minima."
  },
  {
    "sortIndex": "392",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.7 b.",
    "description": "Graph square root, cube root, and piecewise-defined functions, including step functions and absolute value functions."
  },
  {
    "sortIndex": "393",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.7 c.",
    "description": "Graph polynomial functions, identifying zeros when suitable factorizations are available, and showing end behavior."
  },
  {
    "sortIndex": "394",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.7 d.",
    "description": "(+) Graph rational functions, identifying zeros and asymptotes when suitable factorizations are available, and showing end behavior."
  },
  {
    "sortIndex": "395",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.7 e.",
    "description": "Graph exponential and logarithmic functions, showing intercepts and end behavior, and trigonometric functions, showing period, midline, and amplitude."
  },
  {
    "sortIndex": "396",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.8",
    "description": "Write a function defined by an expression in different but equivalent forms to reveal and explain different properties of the function."
  },
  {
    "sortIndex": "397",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.8 a.",
    "description": "Use the process of factoring and completing the square in a quadratic function to show zeros, extreme values, and symmetry of the graph, and interpret these in terms of a context."
  },
  {
    "sortIndex": "398",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.8 b.",
    "description": "Use the properties of exponents to interpret expressions for exponential functions.  For example, identify percent rate of change in functions such as y = (1.02)t, y = (0.97)t, y = (1.01)12t, y = (1.2)t/10, and classify them as representing exponential growth or decay."
  },
  {
    "sortIndex": "399",
    "category": "HS",
    "subCategory": "Interpreting Functions. Analyze functions using different representations.",
    "code": "F.IF.9",
    "description": "Compare properties of two functions each represented in a different way (algebraically, graphically, numerically in tables, or by verbal descriptions).  For example, given a graph of one quadratic function and an algebraic expression for another, say which has the larger maximum."
  },
  {
    "sortIndex": "400",
    "category": "HS",
    "subCategory": "Building Functions. Build a function that models a relationship between two quantities.",
    "code": "F.BF.1",
    "description": "Write a function that describes a relationship between two quantities.★"
  },
  {
    "sortIndex": "401",
    "category": "HS",
    "subCategory": "Building Functions. Build a function that models a relationship between two quantities.",
    "code": "F.BF.1 a.",
    "description": "Determine an explicit expression, a recursive process, or steps for calculation from a context."
  },
  {
    "sortIndex": "402",
    "category": "HS",
    "subCategory": "Building Functions. Build a function that models a relationship between two quantities.",
    "code": "F.BF.1 b.",
    "description": "Combine standard function types using arithmetic operations.  For example, build a function that models the temperature of a cooling body by adding a constant function to a decaying exponential, and relate these functions to the model."
  },
  {
    "sortIndex": "403",
    "category": "HS",
    "subCategory": "Building Functions. Build a function that models a relationship between two quantities.",
    "code": "F.BF.1 c.",
    "description": "(+) Compose functions.  For example, if T(y) is the temperature in the atmosphere as a function of height, and h(t) is the height of a weather balloon as a function of time, then T(h(t)) is the temperature at the location of the weather balloon as a function of time."
  },
  {
    "sortIndex": "404",
    "category": "HS",
    "subCategory": "Building Functions. Build a function that models a relationship between two quantities.",
    "code": "F.BF.2",
    "description": "Write arithmetic and geometric sequences both recursively and with an explicit formula, use them to model situations, and translate between the two forms.★"
  },
  {
    "sortIndex": "405",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.3",
    "description": "Identify the effect on the graph of replacing f(x) by f(x) + k, k f(x), f(kx), and f(x + k) for specific values of k (both positive and negative); find the value of k given the graphs. Experiment with cases and illustrate an explanation of the effects on the graph using technology. Include recognizing even and odd functions from their graphs and algebraic expressions for them."
  },
  {
    "sortIndex": "406",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.4",
    "description": "Find inverse functions."
  },
  {
    "sortIndex": "407",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.4 a.",
    "description": "Solve an equation of the form f(x) = c for a simple function f that has an inverse and write an expression for the inverse.  For example, f(x) =2 x3 or f(x) = (x+1)/(x–1) for x ≠1."
  },
  {
    "sortIndex": "408",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.4 b.",
    "description": "(+) Verify by composition that one function is the inverse of another."
  },
  {
    "sortIndex": "409",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.4 c.",
    "description": "(+) Read values of an inverse function from a graph or a table, given that the function has an inverse."
  },
  {
    "sortIndex": "410",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.4 d.",
    "description": "(+) Produce an invertible function from a non-invertible function by restricting the domain."
  },
  {
    "sortIndex": "411",
    "category": "HS",
    "subCategory": "Building Functions. Build new functions from existing functions.",
    "code": "F.BF.5",
    "description": "(+) Understand the inverse relationship between exponents and logarithms and use this relationship to solve problems involving logarithms and exponents."
  },
  {
    "sortIndex": "412",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.1",
    "description": "Distinguish between situations that can be modeled with linear functions and with exponential functions."
  },
  {
    "sortIndex": "413",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.1 a.",
    "description": "Prove that linear functions grow by equal differences over equal intervals, and that exponential functions grow by equal factors over equal intervals."
  },
  {
    "sortIndex": "414",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.1 b.",
    "description": "Recognize situations in which one quantity changes at a constant rate per unit interval relative to another."
  },
  {
    "sortIndex": "415",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.1 c.",
    "description": "Recognize situations in which a quantity grows or decays by a constant percent rate per unit interval relative to another."
  },
  {
    "sortIndex": "416",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.2",
    "description": "Construct linear and exponential functions, including arithmetic and geometric sequences, given a graph, a description of a relationship, or two input-output pairs (include reading these from a table)."
  },
  {
    "sortIndex": "417",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.3",
    "description": "Observe using graphs and tables that a quantity increasing exponentially eventually exceeds a quantity increasing linearly, quadratically, or (more generally) as a polynomial function."
  },
  {
    "sortIndex": "418",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Construct and compare linear and exponential models and solve problems.",
    "code": "F.LE.4",
    "description": "For exponential models, express as a logarithm the solution to abct = d where a, c, and d are numbers and the base b is 2, 10, or e; evaluate the logarithm using technology."
  },
  {
    "sortIndex": "419",
    "category": "HS",
    "subCategory": "Linear and Exponential Models*. Interpret expressions for functions in terms of the situation they model.",
    "code": "F.LE.5",
    "description": "Interpret the parameters in a linear or exponential function in terms of a context."
  },
  {
    "sortIndex": "420",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Extend the domain of trigonometric functions using the unit circle.",
    "code": "F.TF.1",
    "description": "Understand radian measure of an angle as the length of the arc on the unit circle subtended by the angle."
  },
  {
    "sortIndex": "421",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Extend the domain of trigonometric functions using the unit circle.",
    "code": "F.TF.2",
    "description": "Explain how the unit circle in the coordinate plane enables the extension of trigonometric functions to all real numbers, interpreted as radian measures of angles traversed counterclockwise around the unit circle."
  },
  {
    "sortIndex": "422",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Extend the domain of trigonometric functions using the unit circle.",
    "code": "F.TF.3",
    "description": "(+) Use special triangles to determine geometrically the values of sine, cosine, tangent for p/3, p/4 and p/6, and use the unit circle to express the values of sine, cosines, and tangent for x, p+x, and 2p–x in terms of their values for x, where x is any real number."
  },
  {
    "sortIndex": "423",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Extend the domain of trigonometric functions using the unit circle.",
    "code": "F.TF.4",
    "description": "(+) Use the unit circle to explain symmetry (odd and even) and periodicity of trigonometric functions."
  },
  {
    "sortIndex": "424",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Model periodic phenomena with trigonometric functions.",
    "code": "F.TF.5",
    "description": "Choose trigonometric functions to model periodic phenomena with specified amplitude, frequency, and midline.★"
  },
  {
    "sortIndex": "425",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Model periodic phenomena with trigonometric functions.",
    "code": "F.TF.6",
    "description": "(+) Understand that restricting a trigonometric function to a domain on which it is always increasing or always decreasing allows its inverse to be constructed."
  },
  {
    "sortIndex": "426",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Model periodic phenomena with trigonometric functions.",
    "code": "F.TF.7",
    "description": "(+) Use inverse functions to solve trigonometric equations that arise in modeling contexts; evaluate the solutions using technology, and interpret them in terms of the context.★"
  },
  {
    "sortIndex": "427",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Prove and apply trigonometric identities.",
    "code": "F.TF.8",
    "description": "Prove the Pythagorean identity sin2(θ) + cos2(θ) = 1 and use it to find sin(θ), cos(θ),or tan(θ) given sin(θ), cos(θ), or tan(θ) and the quadrant of the angle."
  },
  {
    "sortIndex": "428",
    "category": "HS",
    "subCategory": "Trigonometric Functions. Prove and apply trigonometric identities.",
    "code": "F.TF.9",
    "description": "(+) Prove the addition and subtraction formulas for sine, cosine, and tangent and use them to solve problems."
  },
  {
    "sortIndex": "429",
    "category": "HS",
    "subCategory": "Congruence. Experiment with transformations in the plane.",
    "code": "G.CO.1",
    "description": "Know precise definitions of angle, circle, perpendicular line, parallel line, and line segment, based on the undefined notions of point, line, distance along a line, and distance around a circular arc."
  },
  {
    "sortIndex": "430",
    "category": "HS",
    "subCategory": "Congruence. Experiment with transformations in the plane.",
    "code": "G.CO.2",
    "description": "Represent transformations in the plane using, e.g., transparencies and geometry software; describe transformations as functions that take points in the plane as inputs and give other points as outputs. Compare transformations that preserve distance and angle to those that do not (e.g., translation versus horizontal stretch)."
  },
  {
    "sortIndex": "431",
    "category": "HS",
    "subCategory": "Congruence. Experiment with transformations in the plane.",
    "code": "G.CO.3",
    "description": "Given a rectangle, parallelogram, trapezoid, or regular polygon, describe the rotations and reflections that carry it onto itself."
  },
  {
    "sortIndex": "432",
    "category": "HS",
    "subCategory": "Congruence. Experiment with transformations in the plane.",
    "code": "G.CO.4",
    "description": "Develop definitions of rotations, reflections, and translations in terms of angles, circles, perpendicular lines, parallel lines, and line segments."
  },
  {
    "sortIndex": "433",
    "category": "HS",
    "subCategory": "Congruence. Experiment with transformations in the plane.",
    "code": "G.CO.5",
    "description": "Given a geometric figure and a rotation, reflection, or translation, draw the transformed figure using, e.g., graph paper, tracing paper, or geometry software. Specify a sequence of transformations that will carry a given figure onto another."
  },
  {
    "sortIndex": "434",
    "category": "HS",
    "subCategory": "Congruence. Understand congruence in terms of rigid motions.",
    "code": "G.CO.6",
    "description": "Use geometric descriptions of rigid motions to transform figures and to predict the effect of a given rigid motion on a given figure; given two figures, use the definition of congruence in terms of rigid motions to decide if they are congruent."
  },
  {
    "sortIndex": "435",
    "category": "HS",
    "subCategory": "Congruence. Understand congruence in terms of rigid motions.",
    "code": "G.CO.7",
    "description": "Use the definition of congruence in terms of rigid motions to show that two triangles are congruent if and only if corresponding pairs of sides and corresponding pairs of angles are congruent."
  },
  {
    "sortIndex": "436",
    "category": "HS",
    "subCategory": "Congruence. Understand congruence in terms of rigid motions.",
    "code": "G.CO.8",
    "description": "Explain how the criteria for triangle congruence (ASA, SAS, and SSS) follow from the definition of congruence in terms of rigid motions."
  },
  {
    "sortIndex": "437",
    "category": "HS",
    "subCategory": "Congruence. Prove geometric theorems.",
    "code": "G.CO.9",
    "description": "Prove theorems about lines and angles. Theorems include: vertical angles are congruent; when a transversal crosses parallel lines, alternate interior angles are congruent and corresponding angles are congruent; points on a perpendicular bisector of a line segment are exactly those equidistant from the segment’s endpoints."
  },
  {
    "sortIndex": "438",
    "category": "HS",
    "subCategory": "Congruence. Prove geometric theorems.",
    "code": "G.CO.10",
    "description": "Prove theorems about triangles. Theorems include: measures of interior angles of a triangle sum to 180°; base angles of isosceles triangles are congruent; the segment joining midpoints of two sides of a triangle is parallel to the third side and half the length; the medians of a triangle meet at a point."
  },
  {
    "sortIndex": "439",
    "category": "HS",
    "subCategory": "Congruence. Prove geometric theorems.",
    "code": "G.CO.11",
    "description": "Prove theorems about parallelograms. Theorems include: opposite sides are congruent, opposite angles are congruent, the diagonals of a parallelogram bisect each other, and conversely, rectangles are parallelograms with congruent diagonals."
  },
  {
    "sortIndex": "440",
    "category": "HS",
    "subCategory": "Congruence. Make geometric constructions.",
    "code": "G.CO.12",
    "description": "Make formal geometric constructions with a variety of tools and methods (compass and straightedge, string, reflective devices, paper folding, dynamic geometric software, etc.). Copying a segment; copying an angle; bisecting a segment; bisecting an angle; constructing perpendicular lines, including the perpendicular bisector of a line segment; and constructing a line parallel to a given line through a point not on the line."
  },
  {
    "sortIndex": "441",
    "category": "HS",
    "subCategory": "Congruence. Make geometric constructions.",
    "code": "G.CO.13",
    "description": "Construct an equilateral triangle, a square, and a regular hexagon inscribed in a circle."
  },
  {
    "sortIndex": "442",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Understand similarity in terms of similarity transformations.",
    "code": "G.SRT.1",
    "description": "Verify experimentally the properties of dilations given by a center and a scale factor:"
  },
  {
    "sortIndex": "443",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Understand similarity in terms of similarity transformations.",
    "code": "G.SRT.1 a.",
    "description": "A dilation takes a line not passing through the center of the dilation to a parallel line, and leaves a line passing through the center unchanged."
  },
  {
    "sortIndex": "444",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Understand similarity in terms of similarity transformations.",
    "code": "G.SRT.1 b.",
    "description": "The dilation of a line segment is longer or shorter in the ratio given by the scale factor."
  },
  {
    "sortIndex": "445",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Understand similarity in terms of similarity transformations.",
    "code": "G.SRT.2",
    "description": "Given two figures, use the definition of similarity in terms of similarity transformations to decide if they are similar; explain using similarity transformations the meaning of similarity for triangles as the equality of all corresponding pairs of angles and the proportionality of all corresponding pairs of sides."
  },
  {
    "sortIndex": "446",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Understand similarity in terms of similarity transformations.",
    "code": "G.SRT.3",
    "description": "Use the properties of similarity transformations to establish the AA criterion for two triangles to be similar."
  },
  {
    "sortIndex": "447",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Prove theorems involving similarity.",
    "code": "G.SRT.4",
    "description": "Prove theorems about triangles. Theorems include: a line parallel to one side of a triangle divides the other two proportionally, and conversely; the Pythagorean Theorem proved using triangle similarity."
  },
  {
    "sortIndex": "448",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Prove theorems involving similarity.",
    "code": "G.SRT.5",
    "description": "Use congruence and similarity criteria for triangles to solve problems and to prove relationships in geometric figures."
  },
  {
    "sortIndex": "449",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Define trigonometric ratios and solve problems involving right triangles.",
    "code": "G.SRT.6",
    "description": "Understand that by similarity, side ratios in right triangles are properties of the angles in the triangle, leading to definitions of trigonometric ratios for acute angles."
  },
  {
    "sortIndex": "450",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Define trigonometric ratios and solve problems involving right triangles.",
    "code": "G.SRT.7",
    "description": "Explain and use the relationship between the sine and cosine of complementary angles."
  },
  {
    "sortIndex": "451",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Define trigonometric ratios and solve problems involving right triangles.",
    "code": "G.SRT.8",
    "description": "Use trigonometric ratios and the Pythagorean Theorem to solve right triangles in applied problems.«"
  },
  {
    "sortIndex": "452",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Apply trigonometry to general triangles.",
    "code": "G.SRT.9",
    "description": "(+) Derive the formula A = 1/2 ab sin(C) for the area of a triangle by drawing an auxiliary line from a vertex perpendicular to the opposite side."
  },
  {
    "sortIndex": "453",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Apply trigonometry to general triangles.",
    "code": "G.SRT.10",
    "description": "(+) Prove the Laws of Sines and Cosines and use them to solve problems."
  },
  {
    "sortIndex": "454",
    "category": "HS",
    "subCategory": "Similarity, Right Triangles, and Trigonometry. Apply trigonometry to general triangles.",
    "code": "G.SRT.11",
    "description": "(+) Understand and apply the Law of Sines and the Law of Cosines to find unknown measurements in right and non-right triangles (e.g., surveying problems, resultant forces)."
  },
  {
    "sortIndex": "455",
    "category": "HS",
    "subCategory": "Circles. Understand and apply theorems about circles.",
    "code": "G.C.1",
    "description": "Prove that all circles are similar."
  },
  {
    "sortIndex": "456",
    "category": "HS",
    "subCategory": "Circles. Understand and apply theorems about circles.",
    "code": "G.C.2",
    "description": "Identify and describe relationships among inscribed angles, radii, and chords. Include the relationship between central, inscribed, and circumscribed angles; inscribed angles on a diameter are right angles; the radius of a circle is perpendicular to the tangent where the radius intersects the circle."
  },
  {
    "sortIndex": "457",
    "category": "HS",
    "subCategory": "Circles. Understand and apply theorems about circles.",
    "code": "G.C.3",
    "description": "Construct the inscribed and circumscribed circles of a triangle, and prove properties of angles for a quadrilateral inscribed in a circle."
  },
  {
    "sortIndex": "458",
    "category": "HS",
    "subCategory": "Circles. Understand and apply theorems about circles.",
    "code": "G.C.4",
    "description": "(+) Construct a tangent line from a point outside a given circle to the circle."
  },
  {
    "sortIndex": "459",
    "category": "HS",
    "subCategory": "Circles. Find arc lengths and areas of sectors of circles.",
    "code": "G.C.5",
    "description": "Derive using similarity the fact that the length of the arc intercepted by an angle is proportional to the radius, and define the radian measure of the angle as the constant of proportionality; derive the formula for the area of a sector."
  },
  {
    "sortIndex": "460",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Translate between the geometric description and the equation for a conic section.",
    "code": "G.GPE.1",
    "description": "Derive the equation of a circle of given center and radius using the Pythagorean Theorem; complete the square to find the center and radius of a circle given by an equation."
  },
  {
    "sortIndex": "461",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Translate between the geometric description and the equation for a conic section.",
    "code": "G.GPE.2",
    "description": "Derive the equation of a parabola given a focus and directrix."
  },
  {
    "sortIndex": "462",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Translate between the geometric description and the equation for a conic section.",
    "code": "G.GPE.3",
    "description": "(+)Derive the equations of ellipses and hyperbolas given the foci, using the fact that the sum or difference of distances from the foci is constant."
  },
  {
    "sortIndex": "463",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Use coordinates to prove simple geometric theorems algebraically.",
    "code": "G.GPE.4",
    "description": "Use coordinates to prove simple geometric theorems algebraically.  For example, prove or disprove that a figure defined by four given points in the coordinate plane is a rectangle; prove or disprove that the point (1, Ö3) lies on the circle centered at the origin and containing the point (0, 2)."
  },
  {
    "sortIndex": "464",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Use coordinates to prove simple geometric theorems algebraically.",
    "code": "G.GPE.5",
    "description": "Prove the slope criteria for parallel and perpendicular lines and use them to solve geometric problems (e.g., find the equation of a line parallel or perpendicular to a given line that passes through a given point)."
  },
  {
    "sortIndex": "465",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Use coordinates to prove simple geometric theorems algebraically.",
    "code": "G.GPE.6",
    "description": "Find the point on a directed line segment between two given points that partitions the segment in a given ratio."
  },
  {
    "sortIndex": "466",
    "category": "HS",
    "subCategory": "Expressing Geometric Properties with Equations. Use coordinates to prove simple geometric theorems algebraically.",
    "code": "G.GPE.7",
    "description": "Use coordinates to compute perimeters of polygons and areas of triangles and rectangles, e.g., using the distance formula.★"
  },
  {
    "sortIndex": "467",
    "category": "HS",
    "subCategory": "Geometric Measurement and Dimension. Explain volume formulas and use them to solve problems.",
    "code": "G.GMD.1",
    "description": "Give an informal argument for the formulas for the circumference of a circle, area of a circle, volume of a cylinder, pyramid, and cone. Use dissection arguments, Cavalieri’s principle, and informal limit arguments."
  },
  {
    "sortIndex": "468",
    "category": "HS",
    "subCategory": "Geometric Measurement and Dimension. Explain volume formulas and use them to solve problems.",
    "code": "G.GMD.2",
    "description": "(+) Give an informal argument using Cavalieri’s principle for the formulas for the volume of a sphere and other solid figures."
  },
  {
    "sortIndex": "469",
    "category": "HS",
    "subCategory": "Geometric Measurement and Dimension. Explain volume formulas and use them to solve problems.",
    "code": "G.GMD.3",
    "description": "Use volume formulas for cylinders, pyramids, cones, and spheres to solve problems.★"
  },
  {
    "sortIndex": "470",
    "category": "HS",
    "subCategory": "Geometric Measurement and Dimension. Visualize relationships between two-dimensional and three-dimensional objects.",
    "code": "G.GMD.4",
    "description": "Identify the shapes of two-dimensional cross-sections of three-dimensional objects, and identify three-dimensional objects generated by rotations of two-dimensional objects."
  },
  {
    "sortIndex": "471",
    "category": "HS",
    "subCategory": "Modeling with Geometry. Apply geometric concepts in modeling situations.",
    "code": "G.MG.1",
    "description": "Use geometric shapes, their measures, and their properties to describe objects (e.g., modeling a tree trunk or a human torso as a cylinder).★"
  },
  {
    "sortIndex": "472",
    "category": "HS",
    "subCategory": "Modeling with Geometry. Apply geometric concepts in modeling situations.",
    "code": "G.MG.2",
    "description": "Apply concepts of density based on area and volume in modeling situations (e.g., persons per square mile, BTUs per cubic foot).★"
  },
  {
    "sortIndex": "473",
    "category": "HS",
    "subCategory": "Modeling with Geometry. Apply geometric concepts in modeling situations.",
    "code": "G.MG.3",
    "description": "Apply geometric methods to solve design problems (e.g., designing an object or structure to satisfy physical constraints or minimize cost; working with typographic grid systems based on ratios).★"
  },
  {
    "sortIndex": "474",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on a single count or measurement variable.",
    "code": "S.ID.1",
    "description": "Represent data with plots on the real number line (dot plots, histograms, and box plots)."
  },
  {
    "sortIndex": "475",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on a single count or measurement variable.",
    "code": "S.ID.2",
    "description": "Use statistics appropriate to the shape of the data distribution to compare center (median, mean) and spread (interquartile range, standard deviation) of two or more different data sets."
  },
  {
    "sortIndex": "476",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on a single count or measurement variable.",
    "code": "S.ID.3",
    "description": "Interpret differences in shape, center, and spread in the context of the data sets, accounting for possible effects of extreme data points (outliers)."
  },
  {
    "sortIndex": "477",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on a single count or measurement variable.",
    "code": "S.ID.4",
    "description": "Use the mean and standard deviation of a data set to fit it to a normal distribution and to estimate population percentages. Recognize that there are data sets for which such a procedure is not appropriate. Use calculators, spreadsheets, and tables to estimate areas under the normal curve."
  },
  {
    "sortIndex": "478",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on two categorical and quantitative variables.",
    "code": "S.ID.5",
    "description": "Summarize categorical data for two categories in two-way frequency tables. Interpret relative frequencies in the context of the data (including joint, marginal, and conditional relative frequencies). Recognize possible associations and trends in the data."
  },
  {
    "sortIndex": "479",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on two categorical and quantitative variables.",
    "code": "S.ID.6",
    "description": "Represent data on two quantitative variables on a scatter plot, and describe how the variables are related."
  },
  {
    "sortIndex": "480",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on two categorical and quantitative variables.",
    "code": "S.ID.6 a.",
    "description": "Fit a function to the data; use functions fitted to data to solve problems in the context of the data. Use given functions or choose a function suggested by the context. Emphasize linear and exponential models."
  },
  {
    "sortIndex": "481",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on two categorical and quantitative variables.",
    "code": "S.ID.6 b.",
    "description": "Informally assess the fit of a function by plotting and analyzing residuals."
  },
  {
    "sortIndex": "482",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Summarize, represent, and interpret data on two categorical and quantitative variables.",
    "code": "S.ID.6 c.",
    "description": "Fit a linear function for a scatter plot that suggests a linear association."
  },
  {
    "sortIndex": "483",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Interpret linear models.",
    "code": "S.ID.7",
    "description": "Interpret the slope (rate of change) and the intercept (constant term) of a linear model in the context of the data."
  },
  {
    "sortIndex": "484",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Interpret linear models.",
    "code": "S.ID.8",
    "description": "Compute (using technology) and interpret the correlation coefficient of a linear fit."
  },
  {
    "sortIndex": "485",
    "category": "HS",
    "subCategory": "Interpreting Categorical and Quantitative Data. Interpret linear models.",
    "code": "S.ID.9",
    "description": "Distinguish between correlation and causation."
  },
  {
    "sortIndex": "486",
    "category": "HS",
    "subCategory": "Making Inferences and Justifying Conclusions. Understand and evaluate random processes underlying statistical experiments.",
    "code": "S.IC.1",
    "description": "Understand statistics as a process for making inferences about population parameters based on a random sample from that population."
  },
  {
    "sortIndex": "487",
    "category": "HS",
    "subCategory": "Making Inferences and Justifying Conclusions. Understand and evaluate random processes underlying statistical experiments.",
    "code": "S.IC.2",
    "description": "Decide if a specified model is consistent with results from a given data-generating process, e.g., using simulation.  For example, a model says a spinning coin falls heads up with probability 0.5. Would a result of 5 tails in a row cause you to question the model?"
  },
  {
    "sortIndex": "488",
    "category": "HS",
    "subCategory": "Making Inferences and Justifying Conclusions. Make inferences and justify conclusions from sample surveys, experiments, and observational studies.",
    "code": "S.IC.3",
    "description": "Recognize the purposes of and differences among sample surveys, experiments, and observational studies; explain how randomization relates to each."
  },
  {
    "sortIndex": "489",
    "category": "HS",
    "subCategory": "Making Inferences and Justifying Conclusions. Make inferences and justify conclusions from sample surveys, experiments, and observational studies.",
    "code": "S.IC.4",
    "description": "Use data from a sample survey to estimate a population mean or proportion; develop a margin of error through the use of simulation models for random sampling."
  },
  {
    "sortIndex": "490",
    "category": "HS",
    "subCategory": "Making Inferences and Justifying Conclusions. Make inferences and justify conclusions from sample surveys, experiments, and observational studies.",
    "code": "S.IC.5",
    "description": "Use data from a randomized experiment to compare two treatments; use simulations to decide if differences between parameters are significant."
  },
  {
    "sortIndex": "491",
    "category": "HS",
    "subCategory": "Making Inferences and Justifying Conclusions. Make inferences and justify conclusions from sample surveys, experiments, and observational studies.",
    "code": "S.IC.6",
    "description": "Evaluate reports based on data."
  },
  {
    "sortIndex": "492",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Understand independence and conditional probability and use them to interpret data.",
    "code": "S.CP.1",
    "description": "Describe events as subsets of a sample space (the set of outcomes) using characteristics (or categories) of the outcomes, or as unions, intersections, or complements of other events (“or,” “and,” “not”)."
  },
  {
    "sortIndex": "493",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Understand independence and conditional probability and use them to interpret data.",
    "code": "S.CP.2",
    "description": "Understand that two events A and B are independent if the probability of A and B occurring together is the product of their probabilities, and use this characterization to determine if they are independent."
  },
  {
    "sortIndex": "494",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Understand independence and conditional probability and use them to interpret data.",
    "code": "S.CP.3",
    "description": "Understand the conditional probability of A given B as P(A and B)/P(B), and interpret independence of A and B as saying that the conditional probability of A given B is the same as the probability of A, and the conditional probability of B given A is the same as the probability of B."
  },
  {
    "sortIndex": "495",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Understand independence and conditional probability and use them to interpret data.",
    "code": "S.CP.4",
    "description": "Construct and interpret two-way frequency tables of data when two categories are associated with each object being classified. Use the two-way table as a sample space to decide if events are independent and to approximate conditional probabilities.  For example, collect data from a random sample of students in your school on their favorite subject among math, science, and English. Estimate the probability that a randomly selected student from your school will favor science given that the student is in tenth grade. Do the same for other subjects and compare the results."
  },
  {
    "sortIndex": "496",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Understand independence and conditional probability and use them to interpret data.",
    "code": "S.CP.5",
    "description": "Recognize and explain the concepts of conditional probability and independence in everyday language and everyday situations.  For example, compare the chance of having lung cancer if you are a smoker with the chance of being a smoker if you have lung cancer."
  },
  {
    "sortIndex": "497",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Use the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "code": "S.CP.6",
    "description": "Find the conditional probability of A given B as the fraction of B’s outcomes that also belong to A, and interpret the answer in terms of the model."
  },
  {
    "sortIndex": "498",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Use the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "code": "S.CP.7",
    "description": "Apply the Addition Rule, P(A or B) = P(A) + P(B) – P(A and B), and interpret the answer in terms of the model."
  },
  {
    "sortIndex": "499",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Use the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "code": "S.CP.8",
    "description": "(+) Apply the general Multiplication Rule in a uniform probability model, P(A and B) = P(A)P(B|A) = P(B)P(A|B), and interpret the answer in terms of the model."
  },
  {
    "sortIndex": "500",
    "category": "HS",
    "subCategory": "Conditional Probability and the Rules of Probability. Use the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "code": "S.CP.9",
    "description": "(+) Use permutations and combinations to compute probabilities of compound events and solve problems."
  },
  {
    "sortIndex": "501",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Calculate expected values and use them to solve problems.",
    "code": "S.MD.1",
    "description": "(+) Define a random variable for a quantity of interest by assigning a numerical value to each event in a sample space; graph the corresponding probability distribution using the same graphical displays as for data distributions."
  },
  {
    "sortIndex": "502",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Calculate expected values and use them to solve problems.",
    "code": "S.MD.2",
    "description": "(+) Calculate the expected value of a random variable; interpret it as the mean of the probability distribution."
  },
  {
    "sortIndex": "503",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Calculate expected values and use them to solve problems.",
    "code": "S.MD.3",
    "description": "(+) Develop a probability distribution for a random variable defined for a sample space in which theoretical probabilities can be calculated; find the expected value.  For example, find the theoretical probability distribution for the number of correct answers obtained by guessing on all five questions of a multiple-choice test where each question has four choices, and find the expected grade under various grading schemes."
  },
  {
    "sortIndex": "504",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Calculate expected values and use them to solve problems.",
    "code": "S.MD.4",
    "description": "(+) Develop a probability distribution for a random variable defined for a sample space in which probabilities are assigned empirically; find the expected value.  For example, find a current data distribution on the number of TV sets per household in the United States, and calculate the expected number of sets per household. How many TV sets would you expect to find in 100 randomly selected households?"
  },
  {
    "sortIndex": "505",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Use probability to evaluate outcomes of decisions.",
    "code": "S.MD.5",
    "description": "(+) Weigh the possible outcomes of a decision by assigning probabilities to payoff values and finding expected values."
  },
  {
    "sortIndex": "506",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Use probability to evaluate outcomes of decisions.",
    "code": "S.MD.5 a.",
    "description": "Find the expected payoff for a game of chance.  For example, find the expected winnings from a state lottery ticket or a game at a fast food restaurant."
  },
  {
    "sortIndex": "507",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Use probability to evaluate outcomes of decisions.",
    "code": "S.MD.5 b.",
    "description": "Evaluate and compare strategies on the basis of expected values.  For example, compare a high-deductible versus a low-deductible automobile insurance policy using various, but reasonable, chances of having a minor or a major accident."
  },
  {
    "sortIndex": "508",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Use probability to evaluate outcomes of decisions.",
    "code": "S.MD.6",
    "description": "(+) Use probabilities to make fair decisions (e.g., drawing by lots, using a random number generator)."
  },
  {
    "sortIndex": "509",
    "category": "HS",
    "subCategory": "Using Probability to Make Decisions. Use probability to evaluate outcomes of decisions.",
    "code": "S.MD.7",
    "description": "(+) Analyze decisions and strategies using probability concepts (e.g., product testing, medical testing, pulling a hockey goalie at the end of a game)."
  }
]
